{
  "DisplayString": {
    "class": "type",
    "name": "DisplayString",
    "type": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "active_print_jobs": {
    "class": "objectidentity",
    "name": "active_print_jobs",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.2"
  },
  "asset_number": {
    "class": "objecttype",
    "description": "User defined asset number. The POS should indicate the maximum supported string length. If the user entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e. Additional information: The maximum supported string length is 8 characters. If the user entered string is too long, the device will store the first 8 characters and will return the \u003cnoError\u003e status.",
    "maxaccess": "read-write",
    "name": "asset_number",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "auto_continue": {
    "class": "objecttype",
    "description": "Indicates if the device will automatically continue after encountering a continuable error. If AUTO- CONTINUE is set to eOn, the device will automatically generate continue event to acknowledge continuable errors. If AUTO-CONTINUE is set to eOff, then some other continue event will have to acknowledge the continuable error.",
    "maxaccess": "read-write",
    "name": "auto_continue",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "channel": {
    "class": "objectidentity",
    "name": "channel",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.6"
  },
  "channel_bytes_received": {
    "class": "objecttype",
    "description": "The low order 31 bits of the number of bytes received by the printer from the host on this logical channel.",
    "maxaccess": "read-only",
    "name": "channel_bytes_received",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "channel_bytes_sent": {
    "class": "objecttype",
    "description": "The low order 31 bits of the number of bytes sent from the printer to the host on this logical channel.",
    "maxaccess": "read-only",
    "name": "channel_bytes_sent",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "channel_entry": {
    "class": "objectidentity",
    "name": "channel_entry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2.1"
  },
  "channel_io_errors": {
    "class": "objecttype",
    "description": "The low order 31 bits of the number of I/O errors which have occured on this logical channel.",
    "maxaccess": "read-only",
    "name": "channel_io_errors",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "channel_jobs_received": {
    "class": "objecttype",
    "description": "The low order 31 bits of the number of print jobs which have been received on this logical channel.",
    "maxaccess": "read-only",
    "name": "channel_jobs_received",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "channel_table": {
    "class": "objectidentity",
    "name": "channel_table",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7.2"
  },
  "channelnumberofchannels": {
    "class": "objecttype",
    "description": "An indication of how many print data channels the I/O card supports. Additional information: This object is used by the EIO card to tell the peripheral firmware how many logical channels will be used by the card. This object can only be set once per physical channel. If an attempt is made to set it a subsequent time it is ignored and an return code of \u003cgenErr\u003e is returned.",
    "maxaccess": "write-only",
    "name": "channelnumberofchannels",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.6.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "channelprinteralert": {
    "class": "objecttype",
    "description": "Identifies the values of prtAlertIndex, prtAlertSeverityLevel, prtAlertGroup, prtAlertGroupIndex, prtAlertLocation, and prtAlertCode for the latest critical evnet in the prtAlertTable. The binary string is defined as following: ------------------------------------------------------ Field | Filed | Description Offset | Length | ------------------------------------------------------ 0 | 4 | the value of prtAlertIndex 4 | 4 | the value of prtAlertSeverityLevel 8 | 4 | the value of prtAlertGroup 12 | 4 | the value of prtAlertGroupIndex 16 | 4 | the value of prtAlertLocation 20 | 4 | the value of prtAlertCode ------------------------------------------------------ Each field is in Big Endian style. Additional information: This object is used to pass alert information from the peripheral to the IIO card. The standard printer MIB contains the following description: printerAlert TRAP-TYPE ENTERPRISE printerV1Alert VARIABLES { prtAlertIndex, prtAlertSeverityLevel, prtAlertGroup, prtAlertGroupIndex, prtAlertLocation, prtAlertCode } DESCRIPTION \u0027This trap is sent whenever a critical event is added to the prtAlertTable.\u0027 In order to provide this information in the trap packet, the IIO card enables traps on channelPrinterAlert. When a critical alert is generated the peripheral fills the appropriate value into this object and sends it to the card. This object is a structure which contains 24 bytes of data. The structure is: struct structAlertInfo { sint32 prtAlertIndex; sint32 prtAlertSeverityLevel; sint32 prtAlertGroup; sint32 prtAlertGroupIndex; sint32 prtAlertLocation; sint32 prtAlertCode; } thisAlertData;",
    "maxaccess": "read-only",
    "name": "channelprinteralert",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.6.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "cold_reset_media_size": {
    "class": "objecttype",
    "description": "Returns or sets the media size that is used as the DEFAULT-MEDIA-SIZE when a cold reset occurs.",
    "maxaccess": "read-write",
    "name": "cold_reset_media_size",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.19",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eISOandJISA4": 26,
          "eUSLetter": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "current_job_parsing_id": {
    "class": "objecttype",
    "description": "Contains the printer assigned job identification for the job currently being processed by the processing PDL sub- system. The job ID is a monotonically increasing number. The job ID may be reset to zero at power-up and may roll over to zero after reaching some maximum value. Additional information: A value of -1 is returned when the printer is not parsing a job. When data for a new job is detected, this object is updated (the job may or may not turn out to be a Null Job); however, the trap does not occur until the printer determines that it is not a Null Job. (A job is considered to be a \u0027null job\u0027 if it has no name or job attribute, causes no pages to be printed, and consumes MIN_JOB_SIZE (9) or fewer bytes.) A trapped value will differ from the previous value by one or more. See the Job Boundary ERS for details on what constitutes a job boundary. Some job-info- objects are created when the first data bytes are received. If the printer determines that the job is a Null Job, the job-info- objects related to the Null Job are deleted. Laserjet 1200 retains the job-info- objects for the MAX_JOBS_IN_LIST (12) most recent jobs that are not Null Jobs. The first job received after power-up will have job ID 1, and the job ID will increment to 32767 before rolling to zero. To distinguish whether a power cycle or a rollover causes a reduction in the job ID value, the object prtGeneralConfigChanges can be watched and if it increments at the same time as the drop is observed in the value of CURRENT-JOB-PARSING-ID, then a power cycle is the most likely cause.",
    "maxaccess": "read-only",
    "name": "current_job_parsing_id",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.2.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 32767,
            "min": -1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "custom_paper_dim_unit": {
    "class": "objecttype",
    "description": "The units of measure used to specify the width and height of the printer\u0027s custom paper. The unit of measure of eTenThousandthsOfInches is 0.0001 inches. Additional information: The only valid values for this object are eTenThousandthsOfInches (3), and eMicrometers (4). The data for this object is stored in NVRAM.",
    "maxaccess": "read-write",
    "name": "custom_paper_dim_unit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eMicrometers": 4,
          "eTenThousandthsOfInches": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "custom_paper_feed_dim": {
    "class": "objecttype",
    "description": "Sets the printer\u0027s custom paper dimension in the feed direction (direction parallel to the direction of paper feeding). The value for this object is specified in micrometers or tenthousandths of an inch, depending upon the value of CUSTOM-PAPER-DIM-UNIT. The valid range is engine-dependent and should be documented in the POS for each product. Additional information: The valid range is 50000 to 140000 if CUSTOM-PAPER_DIM_UNIT is eTenThousandthsOfInches or 127000 to 355600 if CUSTOM-PAPER-DIM-UNIT is ePmicrometers. Attempts to set this object outside the valid range will result in a return value of \u003cbadError\u003e.",
    "maxaccess": "read-write",
    "name": "custom_paper_feed_dim",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "custom_paper_xfeed_dim": {
    "class": "objecttype",
    "description": "Sets the printer\u0027s custom paper dimension in the cross- feed direction (direction ninety degrees relative to the direction of paper feeding). The value for this object is specified in micrometers or tenthousandths of an inch, depending upon the value of CUSTOM-PAPER-DIM-UNIT. The valid range is engine-dependent and should be documented in the POS for each product. Additional information: The valid range for Brundage is 30000 to 85000 if CUSTOM-PAPER-DIM-UNIT is eTenThousandthsOfInches or 76200 to 216000 if CUSTOM-PAPER-DIM-UNIT is ePmicrometers. Attempts to set this object outside the valid range will result in a return value of \u003cbadValue\u003e.",
    "maxaccess": "read-write",
    "name": "custom_paper_xfeed_dim",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "dark_courier": {
    "class": "objecttype",
    "description": "Returns or changes the dark Courier setting. If eOn, then the Courier font used will approximate the same darkness as the LaserJet III printer. If eOff, then the Courier font used will approximate the same darkness as the LaserJet 4 printer.",
    "maxaccess": "read-write",
    "name": "dark_courier",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.38",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "default_bits_per_pixel": {
    "class": "objecttype",
    "description": "Controls the number of levels used (per pixel) when printing grayscale or color images.",
    "maxaccess": "read-write",
    "name": "default_bits_per_pixel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.39",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "default_copies": {
    "class": "objecttype",
    "description": "Returns or changes default copies. Default copies is the default values used by the PDL to control the number of copies of each page in the print job that are printed. The print job can override this value. The list of supported values should be documented in the device POS. Additional information: The supported values are 1 through 999. Setting to an unsupported value causes the printer to substitute in a snap value and to return \u003cnoError\u003e status. The snaps are as follows: \u003c1 snaps to 1 \u003e999 snaps to 999",
    "maxaccess": "read-write",
    "name": "default_copies",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 999,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "default_horizontal_black_resolution": {
    "class": "objecttype",
    "description": "Returns or changes the value of the default horizontal black resolution. The units are dots per inch. Additional information: In Laserjet 1200 changing this OID also causes DEFAULT-VERTICAL-BLACK RESOLUTION to change. DEFAULT-HORIZONTAL-BLACK-RESOLUTION and DEFAULT-VERTICAL-BLACK-RESOLUTION must always be the same. The supported values are 300, 600 and 1200. Setting to an unsupported value causes the printer to substitute in a snap value and to return \u003cnoError\u003e status. The snap values are as follows: \u003c450 snaps to 300 \u003e=450 and \u003c900 snaps to 600 \u003e=900 snaps to 1200",
    "maxaccess": "read-write",
    "name": "default_horizontal_black_resolution",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "default_lines_per_page": {
    "class": "objecttype",
    "description": "Returns or changes the default number of lines per page. The POS indicates the supported values. An unsupported value causes the printer to use the closest supported value, causing the printer to return the \u003cnoError\u003e. Additional information: The supported values in Laserjet 1200 are 5 to 128. Setting to an unsupported value causes the printer to substitute in a snap value and to return \u003cnoError\u003e status. The snap values are as follows: \u003c5 snaps to 5 \u003e128 snaps to 128",
    "maxaccess": "read-write",
    "name": "default_lines_per_page",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "default_media_size": {
    "class": "objecttype",
    "description": "This indicates the default media size. A write of an unsupported value causes an \u003cbadValue\u003e. Complete list of supported media sizes along with their dimensions are listed in the \u0027\u0027Media Size Table\u0027\u0027 near the end of this document.",
    "maxaccess": "read-write",
    "name": "default_media_size",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eCommercial10": 81,
          "eCustom": 101,
          "eFoolscap": 10,
          "eISOandJISA4": 26,
          "eISOandJISA5": 25,
          "eInternationalB5": 100,
          "eInternationalC5": 91,
          "eInternationalDL": 90,
          "eJISB5": 45,
          "eJapanesePostcardDouble": 72,
          "eJapanesePostcardSingle": 71,
          "eMonarch": 80,
          "eROC16K": 17,
          "eUSExecutive": 1,
          "eUSLegal": 3,
          "eUSLetter": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "default_page_protect": {
    "class": "objecttype",
    "description": "Returns or changes the default page protection behavior. If eOff, the device does not reserve memory for holding the entire raster form of a processed page. If eOn, then memory is reserved. If eAuto, the device determines the amount of memory to reserve. Additional information: Setting to eOn causes MET to be more conservative, but it will not allocate memory to hold an entire rasterized page.",
    "maxaccess": "read-write",
    "name": "default_page_protect",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eAuto": 3,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "default_print_quality": {
    "class": "objecttype",
    "description": "Returns or sets the default print quality. A value of zero has the lowest print quality. A value of 100 has the highest print quality. Each POS should document what values in the 0 to 100 range are supported. Additional information: Laserjet 1200 only supports DEFAULT-PRINT-QUALITY in 300 and 600 dpi. A query on this object in the 1200 dpi case will return \u003cnoSuchName\u003e. In the Laserjet 1200, the supported values are 0 and 100. A value of zero has the lowest print quality (ECONOMODE=ON), thus minimizes the amount of toner used to print a page. A value of 100 has the highest print quality (ECONOMODE=OFF), thus uses more toner to print a page. Setting to an unsupported value outside of the 0 to 100 range causes the printer to return \u003cbadValue\u003e status. Setting to an unsupported value inside of the 0 to 100 range causes the printer to substitute in a snap value (listed below) and to return \u003cnoError\u003e status. The snap values are as follow: 0 to 50 snaps to 0 51 to 100 snaps to 100",
    "maxaccess": "read-write",
    "name": "default_print_quality",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.6.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 100,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "default_ret": {
    "class": "objecttype",
    "description": "Returns or changes the Resolution Enhancement Technology setting. Devices that only support eOff and on should map all other values to on and always return the same non-eOff value to indicate on. The list of supported values should be documented in the device POS.",
    "maxaccess": "read-write",
    "name": "default_ret",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.6.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eDark": 4,
          "eLight": 2,
          "eMedium": 3,
          "eOff": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "default_vertical_black_resolution": {
    "class": "objecttype",
    "description": "Returns or changes the value of the default vertical black resolution. The units are dots per inch. Additional information: In Laserjet 1200 changing this OID also causes DEFAULT-HORIZONTAL-BLACK RESOLUTION to change. DEFAULT-HORIZONTAL-BLACK-RESOLUTION and DEFAULT-VERTICAL-BLACK-RESOLUTION must always be the same. The supported values are 300, 600, and 1200. Setting to an unsupported value causes the printer to substitute in a snap value and to return \u003cnoError\u003e status. The snap values are as follows: \u003c450 will snap to 300 \u003e=450 and \u003c900 will snap to 600 \u003e=900 will snap to 1200",
    "maxaccess": "read-write",
    "name": "default_vertical_black_resolution",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "default_vmi": {
    "class": "objecttype",
    "description": "Returns or changes the default vertical motion index. The unit of measure for VMI is centipoints per line. The POS indicates the supported values. An unsupported value causes the printer to use the closest supported value, causing the printer to return \u003cnoError\u003e. Additional information: Setting this object may cause DEFAULT-LINES-PER-PAGE to change.",
    "maxaccess": "read-write",
    "name": "default_vmi",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "destination_subsystem": {
    "class": "objectidentity",
    "name": "destination_subsystem",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4"
  },
  "device": {
    "class": "objectidentity",
    "name": "device",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1"
  },
  "device_config_token": {
    "class": "objecttype",
    "description": "Provides an advisory locking mechanism for hosts to coordinate exclusive access to a specific device or subset of device capabilities. Setting the object to a unique id will only succeed if the token is currently set to 0. The token is unlocked when it is set to 0. If the token is set to a any value other than 0, then token is locked. If the token was set to a unique id (locked), then an attempt to set (lock) the token will fail. If the token was set to 0 (unlocked), then an attempt to set (lock) the token will succeed in locking the token. A get operation on DEVICE-CONFIG-TOKEN will return its current setting. The device does not prevent access to any objects. It is assumed that hosts will be well behaved; respecting this advisory locking mechanism by: 1) acquiring the lock before changing device config objects, and 2) releasing the lock when done changing device config objects. Additional information: Provides an advisory locking mechanism for hosts to coordinate exclusive access. Setting the object to a unique id will only succeed if the token is currently set to 0. The token is unlocked when it is set to 0. If the token is set to a any value other than 0, then token is locked. If the token was set to a unique id (locked), then an attempt to set (lock) the token will fail. If the token was set to 0 (unlocked), then an attempt to set (lock) the token will succeed in locking the token. A get operation on CONFIG-TOKEN will return its current setting. The device does not prevent access to any objects. It is assumed that hosts will be well behaved; respecting this advisory locking mechanism by: 1) acquiring the lock before changing CONFIG objects, and 2) releasing the lock when done changing CONFIG objects.",
    "maxaccess": "read-write",
    "name": "device_config_token",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.1.28",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 128,
            "min": 128
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "device_location": {
    "class": "objecttype",
    "description": "User defined device location. The POS should indicate the maximum supported string length. If the user entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e. Additional information: The maximum supported string length is 16 characters. If the user entered string is too long, the device will store the first 16 characters and will return the \u003cnoError\u003e status.",
    "maxaccess": "read-write",
    "name": "device_location",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "device_name": {
    "class": "objecttype",
    "description": "User defined device name. The POS should indicate the maximum supported string length. If the user entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e. Additional information: The maximum supported string length is 32 characters. If the user entered string is too long, the device will store the first 32 characters and will return the \u003cnoError\u003e status.",
    "maxaccess": "read-write",
    "name": "device_name",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "dm": {
    "class": "objectidentity",
    "name": "dm",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2"
  },
  "energy_star": {
    "class": "objecttype",
    "description": "Returns or changes the Energy Star sleep value. If the value is greater than zero, then the device will go into energy saving sleep mode after the print engine has been idle for the number of seconds specified by this object. A value of zero means Energy Star is disabled and the device will not go to sleep based on print engine idle time. The value must be non-negative. Additional information: Laserjet 1200 will always be in sleep mode when not processing data. This object will always return a value of 1.",
    "maxaccess": "read-only",
    "name": "energy_star",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error1": {
    "class": "objectidentity",
    "name": "error1",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.1"
  },
  "error10": {
    "class": "objectidentity",
    "name": "error10",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.10"
  },
  "error10_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error10_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.10.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error10_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 10 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error10_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.10.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error1_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: Returns a device specific error code. If the error code returned is \u00270\u0027, then the printer has not yet logged an error for this object. When the maximum number of errors is reached (10 on Laserjet 1200), and a new error occurs, the error in ERROR1-CODE will be replaced by the one in ERROR2-CODE, and so on until the last error object will be given the value of the new error. The error category is returned in the upper 16 bits, either 79 (for service) or 0 (for support). The lower 16 bits encodes the specific error. If an error is not a 79 service error, the value of this object is the PJL USTATUS code. If it is a 79 service error, the lower 16 bits contain the PJL USTATUS code. The types of errors reported for Laserjet 1200 are: Page Punt (21 Print Overrun) 49 Service Error 50-67 Service Error 69 Service Error 70-72 Service Error 79 Service Errors Beam Detect Malfunction Laser Malfunction Engine Communication Error Bad Fan Motor Bad Scanner Motor Bad Beam Detect Bad Fuser NVRAM Error NVRAM Service Bad MIO",
    "maxaccess": "read-only",
    "name": "error1_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error1_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 1 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: This item contains the engine page count when the error occurred. If there is currently no error entry for this object, a \u00270\u0027 will be returned. If ERROR1-CODE object also returns \u00270\u0027, then an error has not yet been logged for this object See ERROR1-CODE for an explanation of the order used for storing errors.",
    "maxaccess": "read-only",
    "name": "error1_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error2": {
    "class": "objectidentity",
    "name": "error2",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.2"
  },
  "error2_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error2_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.2.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error2_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 2 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error2_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.2.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error3": {
    "class": "objectidentity",
    "name": "error3",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.3"
  },
  "error3_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error3_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.3.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error3_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 3 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error3_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.3.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error4": {
    "class": "objectidentity",
    "name": "error4",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.4"
  },
  "error4_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error4_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.4.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error4_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 4 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error4_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.4.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error5": {
    "class": "objectidentity",
    "name": "error5",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.5"
  },
  "error5_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error5_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.5.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error5_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 5 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error5_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.5.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error6": {
    "class": "objectidentity",
    "name": "error6",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.6"
  },
  "error6_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error6_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.6.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error6_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 6 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error6_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.6.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error7": {
    "class": "objectidentity",
    "name": "error7",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.7"
  },
  "error7_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error7_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.7.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error7_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 7 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error7_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.7.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error8": {
    "class": "objectidentity",
    "name": "error8",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.8"
  },
  "error8_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error8_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.8.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error8_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 8 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error8_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.8.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error9": {
    "class": "objectidentity",
    "name": "error9",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.9"
  },
  "error9_code": {
    "class": "objecttype",
    "description": "Contains a device specific error code. Each device POS should list what errors are logged to the error log and the meaning of each supported error code value. Additional information: See ERROR1-CODE.",
    "maxaccess": "read-only",
    "name": "error9_code",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.9.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error9_time_stamp": {
    "class": "objecttype",
    "description": "Contains some sort of time stamp indicating when error 9 occurred. Example time stamps include the actual time the error occurred (in seconds since Jan. 1, 1970), and the total engine page count. The device POS documents the meaning of the time stamp. Additional information: See ERROR1-TIME-STAMP.",
    "maxaccess": "read-only",
    "name": "error9_time_stamp",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11.9.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "error_log_clear": {
    "class": "objecttype",
    "description": "Setting this object clears all the entries in the error log sub-tree. Additional information: Setting this object removes all errors that have been stored in the printer\u0027s non-volatile memory.",
    "maxaccess": "write-only",
    "name": "error_log_clear",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.38",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eClearErrorLog": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "errorlog": {
    "class": "objectidentity",
    "name": "errorlog",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.11"
  },
  "form_feed": {
    "class": "objecttype",
    "description": "Instructs the PDL processing sub-system to finishing processing the current page of the current job. Form feed is also known as close page or eject page. If the PDL processing sub-system is in a FORM-FEED-NEEDED state, this causes the device to flush or finish processing the current page of the current job. If the device is not in the FORM-FEED-NEEDED state, an \u003cgenErr\u003e will occur.",
    "maxaccess": "write-only",
    "name": "form_feed",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eInitiateAction": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "form_feed_needed": {
    "class": "objecttype",
    "description": "Indicates if the PDL processing sub-system has made marks on the current page and the source subsystem has been idle for a device specific amount of time. Additional information: Laserjet 1200 will set this object to eTrue when it has made marks on the current page, the IO-TIMEOUT has expired while PCL was running in \u0027backward-compatibility mode\u0027 (which is caused by jobs consisting purely of PCL data with no prepended PJL commands), and no data is pending on another I/O. Once it is set to eTrue, more data on the same I/O will cause this object to be set to eFalse, until the above conditions are met again.",
    "maxaccess": "read-only",
    "name": "form_feed_needed",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.2.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eFalse": 1,
          "eTrue": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "fw_rom_datecode": {
    "class": "objecttype",
    "description": "Identifies the base system firmware date code. The date code will be encoded in the yyyymmdd format. There may be several versions of the base system firmware. The date code associated with the version of the base system firmware that is being used is reported. There may be other date code objects for other specific modules such as fonts, localization modules, etc.; these other datecode objects are device specific.",
    "maxaccess": "read-only",
    "name": "fw_rom_datecode",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "hp": {
    "class": "objectidentity",
    "name": "hp",
    "oid": "1.3.6.1.4.1.11"
  },
  "hrDevice": {
    "class": "objectidentity",
    "name": "hrDevice",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3"
  },
  "hrDeviceEntry": {
    "class": "objectidentity",
    "name": "hrDeviceEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1"
  },
  "hrDeviceTable": {
    "class": "objectidentity",
    "name": "hrDeviceTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2"
  },
  "hrPrinterEntry": {
    "class": "objectidentity",
    "name": "hrPrinterEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.5.1"
  },
  "hrPrinterTable": {
    "class": "objectidentity",
    "name": "hrPrinterTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.5"
  },
  "hrStorage": {
    "class": "objectidentity",
    "name": "hrStorage",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2"
  },
  "hrStorageEntry": {
    "class": "objectidentity",
    "name": "hrStorageEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1"
  },
  "hrStorageTable": {
    "class": "objectidentity",
    "name": "hrStorageTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3"
  },
  "hrdevicedescr": {
    "class": "objecttype",
    "description": "A textual description of this device, including the device\u0027s manufacturer and revision, and optionally, its serial number. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The serial number is not returned with this object. This object is not localized.",
    "maxaccess": "read-only",
    "name": "hrdevicedescr",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.3",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 64,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "hrdeviceerrors": {
    "class": "objecttype",
    "description": "The number of errors detected on this device. It should be noted that as this object has a SYNTAX of Counter, that it does not have a defined initial value. However, it is recommended that this object be initialized to zero. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: This is the number of critical alerts that have been entered into the alert table since the device was powered on. The maximum value for this object is 2^32-1. At power-on, this object will be set to zero.",
    "maxaccess": "read-only",
    "name": "hrdeviceerrors",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.6",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "hrdeviceid": {
    "class": "objecttype",
    "description": "The product ID for this device. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The complete OID reported by this object is: .1.3.6.1.4.1.11.2.3.9.1.2.19",
    "maxaccess": "read-only",
    "name": "hrdeviceid",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.4",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "OBJECT IDENTIFIER"
    }
  },
  "hrdeviceindex": {
    "class": "objecttype",
    "description": "A unique value for each device contained by the host. The value for each device must remain constant at least from one re-initialization of the agent to the next re-initialization. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The entry in the Device Table which describes the printer.",
    "maxaccess": "read-only",
    "name": "hrdeviceindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.1",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2147483647,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "hrdevicestatus": {
    "class": "objecttype",
    "description": "The current operational state of the device described by this row of the table. A value unknown(1) indicates that the current state of the device is unknown. running(2) indicates that the device is up and running and that no unusual error conditions are known. The warning(3) state indicates that agent has been informed of an unusual error condition by the operational software (e.g., a disk device driver) but that the device is still \u0027operational\u0027. An example would be high number of soft errors on a disk. A value of testing(4), indicates that the device is not available for use because it is in the testing state. The state of down(5) is used only when the agent has been informed that the device is not available for any use. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The printer\u0027s condition is mapped as follows: eHrunning -- Printer ready to print or is printing. May be in power save mode. eHwarning -- A condition exists that needs attention but it is not currently preventing printing. A non-critical alert is active. eHdown -- Printer is not printing because it is offline or a critical alert is active. Human interaction is needed to bring the printer to a ready state.",
    "maxaccess": "read-only",
    "name": "hrdevicestatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.5",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eHdown": 5,
          "eHrunning": 2,
          "eHwarning": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "hrdevicetype": {
    "class": "objecttype",
    "description": "An indication of the type of device. If this value is `hrDeviceProcessor { hrDeviceTypes 3 }\u0027 then an entry exists in the hrProcessorTable which corresponds to this device. If this value is `hrDeviceNetwork { hrDeviceTypes 4 }\u0027, then an entry exists in the hrNetworkTable which corresponds to this device. If this value is `hrDevicePrinter { hrDeviceTypes 5 }\u0027, then an entry exists in the hrPrinterTable which corresponds to this device. If this value is `hrDeviceDiskStorage { hrDeviceTypes 6 }\u0027, then an entry exists in the hrDiskStorageTable which corresponds to this device. Refer to RFC 1514, Host Resources MIB, for more details.",
    "maxaccess": "read-only",
    "name": "hrdevicetype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.2.1.2",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "OBJECT IDENTIFIER"
    }
  },
  "hrm": {
    "class": "objectidentity",
    "name": "hrm",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3"
  },
  "hrmemorysize": {
    "class": "objecttype",
    "description": "The amount of physical main memory contained by the host. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The unit of measure for this object is 1024 bytes. The default value assumes the base printer with no additional memory.",
    "maxaccess": "read-only",
    "name": "hrmemorysize",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.2",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "hrprinterdetectederrorstate": {
    "class": "objecttype",
    "description": "This object represents any error conditions detected by the printer. The error conditions are encoded as bits in an octet string, with the following definitions: Condition Bit # hrDeviceStatus lowPaper 0 warning(3) noPaper 1 down(5) lowToner 2 warning(3) noToner 3 down(5) doorOpen 4 down(5) jammed 5 down(5) offline 6 down(5) serviceRequested 7 warning(3) If multiple conditions are currently detected and the hrDeviceStatus would not otherwise be unknown(1) or testing(4), the hrDeviceStatus shall correspond to the worst state of those indicated, where down(5) is worse than warning(3) which is worse than running(2). Bits are numbered starting with the most significant bit of the first byte being bit 0, the least significant bit of the first byte being bit 7, the most significant bit of the second byte being bit 8, and so on. A one bit encodes that the condition was detected, while a zero bit encodes that the condition was not detected. This object is useful for alerting an operator to specific warning or error conditions that may occur, especially those requiring human intervention. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: Here is the table from the general description, above, rewritten with formatting to make it more easily readable. The error conditions are encoded as bits in an octet string, with the following definitions: Condition.........Bit #......hrDeviceStatus lowPaper...........0...........warning(3) noPaper............1...........down(5) lowToner...........2...........warning(3) noToner............3...........down(5) doorOpen...........4...........down(5) jammed.............5...........down(5) offline............6...........down(5) serviceRequested...7...........warning(3) The HP LaserJet 1200 Series reports error conditions as follows: noPaper -- A tray is empty and must be filled for printing to continue. hrDeviceStatus = eHdown; hrPrinterStatus = eHother; A critical alert is active. coverOpen -- A cover or door is open. hrDeviceStatus = eHdown; hrPrinterStatus = eHother; A critical alert is active. jammed -- A jam condition is preventing printing. hrDeviceStatus = eHdown; hrPrinterStatus = eHother; A critical alert is active. offline -- Printer is offline and will not accept new print jobs until it is online. This condition is rare in the HP LaserJet 1200 Series and may indicate some other error. hrDeviceStatus = eHdown; hrPrinterStatus = eHother; A critical alert is active. serviceRequested -- Any status or error condition not listed above. These fall into two categories: (1) If the condition prevents printing, the \u0027offline\u0027 bit is also set and status values are as for offline. i.e.: hrDeviceStatus = eHdown; hrPrinterStatus = eHother; A critical alert is active. (2) If the condition does not prevent printing the status values are: hrDeviceStatus = eHwarning; hrPrinterStatus = eHidle or eHprinting; A non-critical alert is active. lowToner -- The HP LaserJet 1200 Series does not report this condition. noToner -- The HP LaserJet 1200 Series does not report this condition.",
    "maxaccess": "read-only",
    "name": "hrprinterdetectederrorstate",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.5.1.2",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "hrprinterstatus": {
    "class": "objecttype",
    "description": "The current status of this printer device. When in the idle(1), printing(2), or warmup(3) state, the corresponding hrDeviceStatus should be running(2) or warning(3). When in the unknown state, the corresponding hrDeviceStatus should be unknown(1). Refer to RFC 1514, Host Resources MIB, for more details. Additional information: The printer\u0027s condition is mapped as follows: eHother -- The printer is offline or a critical alert is active. eHidle -- The printer is not doing any of the items listed below for eHprinting status. eHprinting -- A job is currently being processed or printed or a PJL job is being processed. eHwarmup -- If hrDeviceStatus is eHdown, then the printer is currently offline but is resolving the condition that caused it to be offline and it will be online when it is ready to print. If hrDeviceStatus is eHrunning, then the printer was in power save mode and is now becoming ready to print. (In the HP LaserJet 1200 Series this status only occurs very briefly at boot time. At no other time does the printer report \u0027eHwarmup\u0027 status.)",
    "maxaccess": "read-only",
    "name": "hrprinterstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.3.5.1.1",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eHidle": 3,
          "eHother": 1,
          "eHprinting": 4,
          "eHwarmup": 5
        }
      },
      "type": "INTEGER"
    }
  },
  "hrstorageallocationfailures": {
    "class": "objecttype",
    "description": "The number of requests for storage represented by this entry that could not be honored due to not enough storage. It should be noted that as this object has a SYNTAX of Counter, that it does not have a defined initial value. However, it is recommended that this object be initialized to zero. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: This object is set to zero at power on and when any reset is done via prtGeneralReset. This object is incremented whenever the printer is short on memory (codewise: when PersMemoryCycle is called with a parameter of 2).",
    "maxaccess": "read-only",
    "name": "hrstorageallocationfailures",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.7",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "hrstorageallocationunits": {
    "class": "objecttype",
    "description": "The size, in bytes, of the data objects allocated from this pool. If this entry is monitoring sectors, blocks, buffers, or packets, for example, this number will commonly be greater than one. Otherwise this number will typically be one. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: Unit is one byte. For the HP LaserJet 1200 Series this object is constant.",
    "maxaccess": "read-only",
    "name": "hrstorageallocationunits",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.4",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2147483647,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "hrstoragedescr": {
    "class": "objecttype",
    "description": "A description of the type and instance of the storage described by this entry. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: This object is not localized. For the HP LaserJet 1200 Series this object is constant.",
    "maxaccess": "read-only",
    "name": "hrstoragedescr",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.3",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "hrstorageindex": {
    "class": "objecttype",
    "description": "A unique value for each logical storage area contained by the host. Refer to RFC 1514, Host Resources MIB, for more details.",
    "maxaccess": "read-only",
    "name": "hrstorageindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.1",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2147483647,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "hrstoragesize": {
    "class": "objecttype",
    "description": "The size of the storage represented by this entry, in units of hrStorageAllocationUnits. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: Total formatter RAM. (The value of this object is hrMemorySize times the unit of measure for hrMemorySize. In the case of the HP LaserJet 1200 Series this is 4096*1024 bytes.)",
    "maxaccess": "read-only",
    "name": "hrstoragesize",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.5",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2147483647,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "hrstoragetype": {
    "class": "objecttype",
    "description": "The type of storage represented by this entry. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: For the HP LaserJet 1200 Series this object is constant.",
    "maxaccess": "read-only",
    "name": "hrstoragetype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.2",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "type": "OBJECT IDENTIFIER"
    }
  },
  "hrstorageused": {
    "class": "objecttype",
    "description": "The amount of the storage represented by this entry that is allocated, in units of hrStorageAllocationUnits. Refer to RFC 1514, Host Resources MIB, for more details. Additional information: This object returns the amount of memory in use by the printer at the current time. This object should not be used when creating a print job for the device because the amount of memory in use will likely be different when the printer processes the print job.",
    "maxaccess": "read-only",
    "name": "hrstorageused",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.3.2.3.1.6",
    "status": "mandatory",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2147483647,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "id": {
    "class": "objectidentity",
    "name": "id",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3"
  },
  "imaging": {
    "class": "objectidentity",
    "name": "imaging",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.6"
  },
  "imports": {
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "MODULE-IDENTITY",
      "NOTIFICATION-TYPE",
      "OBJECT-IDENTITY",
      "OBJECT-TYPE",
      "iso"
    ],
    "SNMPv2-TC": [
      "DisplayString",
      "TEXTUAL-CONVENTION"
    ],
    "class": "imports"
  },
  "install_date": {
    "class": "objecttype",
    "description": "Identifies the date that the device was installed. The format of the string is \u0027YYYYMMDDHHmmZ\u0027. Where: YYYY is the year. MM is the month (1-12). DD is the day (1-31). HH is the hour of the day (0-23). mm are the minutes (0-59). \u0027Z\u0027 designates Greenwich Mean Time; if \u0027Z\u0027 not specified, value is local time. Device POS must specify the conditions for setting this object. Additional information: This value IS AFFECTED BY NVRAM RESETS, it is set to the default value of 199000300000 when an NVRAM init is done.",
    "maxaccess": "read-only",
    "name": "install_date",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 14,
            "min": 0
          }
        ]
      },
      "type": "DisplayString"
    }
  },
  "interface": {
    "class": "objectidentity",
    "name": "interface",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4"
  },
  "intray": {
    "class": "objectidentity",
    "name": "intray",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3"
  },
  "intray1": {
    "class": "objectidentity",
    "name": "intray1",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.3.1"
  },
  "intrays": {
    "class": "objectidentity",
    "name": "intrays",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.3"
  },
  "io": {
    "class": "objectidentity",
    "name": "io",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.2.1"
  },
  "io_switch": {
    "class": "objecttype",
    "description": "Indicates if the device will switch between I/O channels when a job boundary is encountered and print job data is available on another I/O channel.",
    "maxaccess": "read-only",
    "name": "io_switch",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.2.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eYes": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "io_timeout": {
    "class": "objecttype",
    "description": "The amount of time, in seconds, to wait for more print job data to be received before an I/O timeout occurs. The I/O channel being timed is the I/O channel that received the data associated with the current print job. If an I/O timeout occurs, the PDL processing sub-system assumes all the data associated with the current print job has been received, and processes the end of job in an PDL specific manner. The POS specifies the supported values. Additional information: If an I/O timeout occurs,the PDL processing sub-system will consider it an end of job condition only if there is data from another I/O subsystem waiting to be processed. The supported values are 5 to 300 seconds. Setting to a value outside the supported range returns \u003cbadValue\u003e status.",
    "maxaccess": "read-write",
    "name": "io_timeout",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.2.1.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 300,
            "min": 5
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "job": {
    "class": "objectidentity",
    "name": "job",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6"
  },
  "job_being_parsed": {
    "class": "objectidentity",
    "name": "job_being_parsed",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.2.1"
  },
  "job_info": {
    "class": "objectidentity",
    "name": "job_info",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5"
  },
  "job_info_attr_1": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. Attribute objects are saved sequentially, starting with 1, after the start of a job. If more attributes are set than there are objects to store them, the excess JOBATTR values are ignored. If the corresponding SET JOBATTR= command has not been received when a get is done for this object, a status of \u003cnoSuchName\u003e will be returned.",
    "maxaccess": "read-only",
    "name": "job_info_attr_1",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_10": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_10",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_11": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_11",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_12": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_12",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_13": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_13",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_14": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_14",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.14",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_15": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_15",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.15",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_16": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_16",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.16",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_2": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_2",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_3": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_3",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_4": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_4",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_5": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_5",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_6": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_6",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_7": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_7",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_8": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_8",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attr_9": {
    "class": "objecttype",
    "description": "Returns the value that was set in PJL via the SET JOBATTR= command. See JOB-INFO-ATTR-1 for details.",
    "maxaccess": "read-only",
    "name": "job_info_attr_9",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 80,
            "min": 1
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_attribute": {
    "class": "objectidentity",
    "name": "job_info_attribute",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.23"
  },
  "job_info_change_id": {
    "class": "objecttype",
    "description": "Returns the current value of an object in the job-info sub-tree whose value has changed. Define the object identifier for the object whose value has changed as job-info.required-field.optional-field.job-id. job-info represents the OID prefix of all objects in the job-info sub-tree. Required-field represents the OID field value that follows the job-info prefix. Since some objects in the job-info sub-tree have two OID fields between the job-info prefix and the job-id, the optional-field represents the OID field between the required-field and the job-id field, if present. Using this definition, the format for the JOB-INFO-CHANGE-ID binary value can be described as follows: Bytes 0-3 : required-field Bytes 4-7 : optional-field, or all zeros if there is no optional field Bytes 8-11: Job ID. Bytes 12-n : The value of the object job-info. required-field.optional-field.job-id. All multi-byte values stored in Motorola (big-endian) format, where the most significant byte occurs first. Additional information: Laserjet 1200 will use this object to report changes of the job-info-pages-printed and job-info-state objects. The required-field (bytes 0 through 3) will designate whether the change to be reported involves the pages printed (13) or job state (15). The optional-field (bytes 4 through 7) will always be zeroes. The value-field (bytes 12 through 15) will contain the new value for pages printed or job state cast to a 32-bit integer.",
    "maxaccess": "read-only",
    "name": "job_info_change_id",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 16,
            "min": 16
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "job_info_io_source": {
    "class": "objecttype",
    "description": "Indicates which I/O source, the print job was received over. The value maps to port numbering scheme supported in the DEVICE/SOURCE-SUBSYSTEM/IO/PORTS sub-tree. Additional information: Laserjet 1200 does not support the DEVICE/SOURCE-SUBSYSTEM/IO/PORTS sub-tree.",
    "maxaccess": "read-only",
    "name": "job_info_io_source",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "job_info_name1": {
    "class": "objecttype",
    "description": "Contains the first part of this print job\u0027s name. The last OID field for this dynamic object contains the job ID. Additional information: The job name is the string specified by the NAME= parameter of the @PJL JOB command which allows a maximum of 80 characters. The first 40 characters are in this object and the second 40 are in job-info-name2. The symbol set is Roman-8. When jobs are nested, the value assigned to this object is the name provided by the most recent @PJL JOB NAME= command. If no name is provided, a null string is returned.",
    "maxaccess": "read-only",
    "name": "job_info_name1",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "job_info_name2": {
    "class": "objecttype",
    "description": "Contains the second part of this print job\u0027s name. The last OID field for this dynamic object contains the job ID. Additional information: See job-info-name1-1.",
    "maxaccess": "read-only",
    "name": "job_info_name2",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "job_info_outbins_used": {
    "class": "objecttype",
    "description": "Indicates which output bins this job has delivered printed pages to. The last OID field for this dynamic object contains the job ID. Additional information: Laserjet 1200 has only 1 output bin. cOutbin1 is the top/face-down bin.",
    "maxaccess": "read-only",
    "name": "job_info_outbins_used",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.20",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "job_info_outcome": {
    "class": "objecttype",
    "description": "Indicates if any warning or error conditions were encountered while processing the assoicated job. The last OID field for this dynamic object contains the job ID. Additional information: In Laserjet 1200, warnings and errors are not recorded in this object. Although no meaningful information can be obtained from this object, it is kept around for the compatibility needs of existing software.",
    "maxaccess": "read-only",
    "name": "job_info_outcome",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.19",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOk": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "job_info_pages_printed": {
    "class": "objecttype",
    "description": "Indicates the number of pages printed by the destination subsystem. If non of the cSourceSubsystem, cProcessingSubsystem or cDestinationSubsystem items are in the associated JOB-INFO-STAGE object, then this object contains the total number of pages printed for this job. This value may increase by two each time for duplex jobs. The last OID field for this dynamic object contains the job ID. Additional information: If multiple copies of a page are printed, each copy is counted individually.",
    "maxaccess": "read-only",
    "name": "job_info_pages_printed",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "job_info_pages_processed": {
    "class": "objecttype",
    "description": "Indicates the number of pages processed by the processing subsystem. If neither the cSourceSubsystem or the cProcessingSubsystem items are in the associated JOB-INFO-STAGE object, then this object contains the total number of pages processed for this job. The last OID field for this dynamic object contains the job ID. Additional information: This object is incremented by one when a page is processed (\u0027closed\u0027 by the personality), regardless of the number of pages that are printed as a result of the single page processed. In other words, it does not matter how many identical copies of a page are printed, or no pages may be printed if operating in silent run mode, this count is incremented exactly once per page processed. A page is considered processed when all of the input data has been processed for a page (that is, when the intermediate has been produced and the personality has \u0027closed\u0027 the page). At this time, the image of the page is not necessarily completely formed.",
    "maxaccess": "read-only",
    "name": "job_info_pages_processed",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "job_info_physical_outbins_used": {
    "class": "objecttype",
    "description": "Indicates which physical output bins this job has delivered printed pages to. The last OID field for this dynamic object contains the job ID. Additional information: Laserjet 1200 only has one output bin so this will always be set to cOutbin1. cOutbin1--Face-up bin",
    "maxaccess": "read-only",
    "name": "job_info_physical_outbins_used",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.22",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "job_info_size": {
    "class": "objecttype",
    "description": "Indicates the number of bytes of data processed by the processing subsystem. If neither of the cSourceSubsystem or cProcessingSubsystem items are in the associated JOB-INFO-STAGE object, then this object contains the size of this job, in bytes. The last OID field for this dynamic object contains the job ID. Additional information: This count may be incremented by values other than one as blocks of data are processed; blocks of data (which may be as large as 2K bytes) will be processed in a varying amount of time. During the processing of a job and even when a job completes, an exact count of the number of I/O bytes processed by teh job is not necessarily expected.",
    "maxaccess": "read-only",
    "name": "job_info_size",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.14",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "job_info_stage": {
    "class": "objecttype",
    "description": "Indicates what printer sub-systems are currently processing this print job. The last OID field for this dynamic object contains the job ID. cSourceSubsystem - some of the job is in the printer I/O subsystem. cProcessingSubsystem - some of the job is in the printer imaging processing subsystem. cDestinationSubsystem - some of the job is being printed. Additional information: For Laserjet 1200,cSourceSubsystem and cProcessingSubsystem will always be set and cleared together. They are set when the beginning of the job is detected, and they are cleared when the end of the job is parsed. A non-printing job will never set cDestinationSubsystem. When a page is ready to be printed (the intermediate has been built and the page is \u0027closed\u0027 by the personality), cDestinationSubsystem will be set even if a page of a previous job is currently being printed. cDestinationSubsystem remains set until the last page of the job has finished printing. If a page requires extensive processing and allows all the previous pages of a job to complete printing cDestinationSubsystem will remain set until the last page of the job has finished printing.",
    "maxaccess": "read-only",
    "name": "job_info_stage",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "job_info_state": {
    "class": "objecttype",
    "description": "Indicates the state of the job. The last OID field for this dynamic object contains the job ID. eAborted - the print job was aborted. eWaitingForResources - the print job requires resources that are not currently available. Example resources that can cause the job to wait include the print engine or PDL processor being unavailable. The print engine could be unavailable due to paper out, paper jam, staple out, stapler jam, marking agent low, output bin full, etc. The PDL processor could be unavailable due to an off-line condition. Each printer specific object specification should state which conditions cause a job to be waiting for resources and also state which objects can be retrieved by an application to determine the exact cause of a resource being unavailable. ePrinted - the job has printed. The related JOB-INFO- OUTCOME object indicates if any problems were encountered while the job was processed. eRetained - the job can be reprinted. eTerminating - the job was aborted or cancelled and is currently is terminating. eInterrupted - the job has been interrupted. The job can be continued. ePaused - the job has been paused. The job can be continuted. eCancelled - the job has been cancelled. eProcessing - the job is currently being printed normally.",
    "maxaccess": "read-only",
    "name": "job_info_state",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.5.15",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eAborted": 3,
          "eCancelled": 10,
          "ePrinted": 5,
          "eProcessing": 11,
          "eTerminating": 7,
          "eWaitingForResources": 4
        }
      },
      "type": "INTEGER"
    }
  },
  "job_input_auto_continue_mode": {
    "class": "objecttype",
    "description": "Returns or sets the device behavior when the desired media is not currently available. cCancelJob - The device cancels the job. The device POS should explain what happens if this item is not the only item in the collection. cAutoMediaSizeOverride - The device is allowed to substitute a different size media. cAutoMediaNameOverride - The device is allowed to substitute a different media name. cUSMediaSizeOverride - The device is allowed to substitute US media sizes (letter, etc.) for ISO media sizes (A4, etc.). cISOMediaSizeOverride - The device is allowed to substitute ISO media sizes (A4, etc.) for US media sizes (letter, etc.). Additional information: Returns or sets the device behavior when the desired media is not currently available. cCancelJob - The device cancels the job. cAutoMediaSizeOverride - the device is allowed to substitute a different size media.",
    "maxaccess": "read-write",
    "name": "job_input_auto_continue_mode",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.36",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "OCTET STRING"
    }
  },
  "job_input_auto_continue_timeout": {
    "class": "objecttype",
    "description": "The number of seconds the device waits after a job related continuable error occurs before automatically continuing. An example job related continuable error is the job requesting a media size that is not available. After the timeout expires, the device will continue processing the job as if a continue event occurred, such as the front panel continue key being pressed. If the value is -1, the device does not automatically continue after a job related continuable error occurs. If the value is 0, the device immediately continues. If the value is greater than 0, the value represents the timeout value in seconds.",
    "maxaccess": "read-write",
    "name": "job_input_auto_continue_timeout",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.35",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "maximum_resource_saving_memory": {
    "class": "objecttype",
    "description": "This object\u0027s name is misleading. This object returns the maximum amount of additional memory, in bytes, that can be dedicated to holding PDL permanent soft resources. Additional information: For a PCL-only printer, the value of this object is zero (all resource saving memory is dedicated to PCL).",
    "maxaccess": "read-only",
    "name": "maximum_resource_saving_memory",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "meta": {
    "comments": [
      "ASN.1 source file:///Users/lextm/pysnmp.com/mibs.pysnmp.com/asn1/LJ1200-MIB",
      "Produced by pysmi-1.3.3 at Sun Mar 10 14:57:24 2024",
      "On host MacBook-Pro.local platform Darwin version 23.4.0 by user lextm",
      "Using Python version 3.12.0 (main, Nov 14 2023, 23:52:11) [Clang 15.0.0 (clang-1500.0.40.1)]"
    ],
    "module": "LJ1200-MIB"
  },
  "mio": {
    "class": "objectidentity",
    "name": "mio",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.3"
  },
  "mio1": {
    "class": "objectidentity",
    "name": "mio1",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.3.1"
  },
  "mio1_type": {
    "class": "objecttype",
    "description": "Returns an indication of the type of option installed in MIO/EIO slot 1. See SIMM1-TYPE for an explanation of the enumerations.",
    "maxaccess": "read-only",
    "name": "mio1_type",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.3.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eEmpty": 1,
          "eIOCard": 12,
          "eUnknown": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "model_name": {
    "class": "objecttype",
    "description": "Identifies the device model name (e.g. \u0027\u0027DeskJet 1200C\u0027\u0027). The string is as specific as possible. Capitalization and spacing should match family naming conventions. Products should note in POS if the model name on the HP corporate price list changes but the device reports the previous device name. If the model name changes based on the installed options, the POS should indicate if only the base model name is returned, or if the device senses the installed options and returns the correct model name. If possible, encode the model name in a symbol set (like Roman-8) that matches the ASCII character set and limit the characters used to ASCII characters. Additional information: The value of this object does not change based on the installed options. This default of this object is \u0027HP LaserJet 1200\u0027 for all configurations of the printer. Since the value of this object is frequently used in displaying a list of printers, it is kept relatively short in case systems have limited width for their display area.",
    "maxaccess": "read-only",
    "name": "model_name",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "DisplayString"
    }
  },
  "on_off_line": {
    "class": "objecttype",
    "description": "To bring the PDL processing sub-system on or off line. If the device is a printer, then the printer does not process print job data when the printer is off line. PML communication persists. Additional information: The value of this object is eOnline whenever the printer is in the ready state. This object will return eOffline only when an alert is active. For example, the printer will go eOffline if the cover is open, if the toner cartridge is removed, or if the paper trays are all empty. It is not possible to change the state of the printer with this object. ",
    "maxaccess": "read-only",
    "name": "on_off_line",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOffline": 2,
          "eOnline": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "pcl_default_font_height": {
    "class": "objecttype",
    "description": "Returns or changes the default PCL height. Height is an approximate measure of the body of the type in centipoints. A centipoint is 1/7200 inch. Height applies only to proportional fonts. Point size, in points, can be converted to font height, in centipoints, by multiplying the point size by 100. The POS indicates the supported values. An unsupported value causes the printer to use the closest supported value, causing the printer to return \u003cnoError\u003e. \u0027\u0027Closest\u0027\u0027 means the smallest absolute difference. Additional information: This object refers to the font point size with 400 representing the smallest settable font (4) and 99975 representing the largest settable font (999.75). The default of 1200 is a font point size of 12. Supported values range from 400 to 99975. Setting to an unsupported value causes the printer to substitute in a snap value and to return \u003cnoError\u003e status. The snap values are as follows: \u003c=400 snaps to 400 \u003e=99975 snaps to 99975 Fonts are settable to the nearest quarter point size (i.e. 10, 10.25, 10.50, 10.75). Unsupported values in the range 401 to 99974 snap DOWN to the previous supported value (i.e 25293 snaps to 25275 or 75038 snaps to 75025).",
    "maxaccess": "read-write",
    "name": "pcl_default_font_height",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "pcl_default_font_number": {
    "class": "objecttype",
    "description": "Returns or changes the value of the default font number variable in NVRAM. Writing an unsupported value causes the printer to generate an \u003cbadValue\u003e. Additional information: Valid numbers or 0 - 255, but only font numbers that are included in the PCL FONT LIST are selectable.",
    "maxaccess": "read-write",
    "name": "pcl_default_font_number",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3.15",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "pcl_default_font_source": {
    "class": "objecttype",
    "description": "Returns or changes the value of the default font source variable in NVRAM.",
    "maxaccess": "read-write",
    "name": "pcl_default_font_source",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3.14",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eInternal": 1,
          "ePermanentSoft": 2,
          "eRomSimm1": 10,
          "eRomSimm2": 11,
          "eRomSimm3": 12
        }
      },
      "type": "INTEGER"
    }
  },
  "pcl_default_font_width": {
    "class": "objecttype",
    "description": "Returns or changes the default PCL font width. Width is expressed as the width of a character in centipoints. A centipoint is 1/7200 inch. Width applies only to fixed space fonts. Pitch, in character per inch, can be converted to font width, in centipoints, by dividing 7200 by the pitch. The POS indicates the supported values. An unsupported value causes the printer to use the closest supported value, causing the printer to return \u003cnoError\u003e. \u0027\u0027Closest\u0027\u0027 means the smallest absolute difference. Additional information: Setting to an unsupported value causes the printer to substitue in a snap value (listed below) and return \u003cnoError\u003e status. The snap values for pitch are as follow: \u003c=44 snaps to 44 \u003e=9999 snaps to 9999 Unsupported values in the range 44 - 9999 (.44 - 99.99) snap DOWN to the next supported value.",
    "maxaccess": "read-write",
    "name": "pcl_default_font_width",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3.16",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "pcl_resource_saving_memory_size": {
    "class": "objecttype",
    "description": "Returns or changes the amount of resource saving memory set aside to hold permanent soft PCL resources. Additional information: The value returned by this object is the amount of Resource Saving memory currently dedicated to PCL, regardless of the value of RESOURCE-SAVING. For a PCL-only printer, the value of this object is zero. All memory is dedicated to PCL, but it is not shown as such. If PostScript is installed, the default value of this object is as follows: 0 if RESOURCE-SAVING=eOff. 0 if \u003c12M memory is installed. 400K if \u003e=12M memory is installed and RESOURCE-SAVING=eOn. 400K if =12M memory is installed and RESOURCE-SAVING=eAuto. plus 100K for each 1M over 12M memory installed. If RESOURCE-SAVING=eOn, this object can be used to set the amount of Resource Saving memory currently dedicated to PCL. The range of values supported by this object are: 0 (disables resource saving for PCL). 400K bytes through (400K bytes + value of MAXIMUM-RESOURCE-SAVING-MEMORY) in increments of 100K bytes. If a value is received that is greater than 0 and less than 400K bytes, it will be snapped to 400K bytes and a status of \u003cnoError\u003e will be returned. If an unsupported value greater than 400K bytes is received, it will be snapped down to the nearest 100K value and a status of \u003cnoError\u003e will be returned. Attempting to set this object when RESOURCE-SAVING is eAuto or eOff will cause a status of \u003cgenErr\u003e to be returned.",
    "maxaccess": "read-write",
    "name": "pcl_resource_saving_memory_size",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "pdl": {
    "class": "objectidentity",
    "name": "pdl",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3"
  },
  "pdl_pcl": {
    "class": "objectidentity",
    "name": "pdl_pcl",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.3"
  },
  "pdl_postscript": {
    "class": "objectidentity",
    "name": "pdl_postscript",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.4"
  },
  "pjl": {
    "class": "objectidentity",
    "name": "pjl",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.5"
  },
  "pjl_password": {
    "class": "objecttype",
    "description": "Returns PJL password, if the password is not set (zero). If the password is set, then attempting to retrieve the password causes an \u003cgenErr\u003e to occur and will return the \u003cNullValue\u003e.",
    "maxaccess": "read-only",
    "name": "pjl_password",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.5.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "postscript_print_errors": {
    "class": "objecttype",
    "description": "Returns or changes the value of the print PostScript errors setting. If eOn, PostScript prints an error page showing the error encountered and the stack at the time of the error.",
    "maxaccess": "read-write",
    "name": "postscript_print_errors",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.4.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "postscript_resource_saving_memory_size": {
    "class": "objecttype",
    "description": "Returns or changes the amount of resource saving memory set aside to hold permanent soft PostScript resources. Additional information: The value returned by this object is the amount of Resource Saving memory currently dedicated to PostScript, regardless of the value of RESOURCE-SAVING. Thee default value of this object is as follows: 0 if RESOURCE-SAVING=eOff. 0 if \u003c12M memory is installed. 400K if \u003e=12M memory is installed and RESOURCE-SAVING=eOn. 400K if =12M memory is installed and RESOURCE-SAVING=eAuto. plus 100K for each 1M over 12M memory installed. If RESOURCE-SAVING=eOn, this object can be used to set the amount of Resource Saving memory currently dedicated to PostScript. The range of values supported by this object are: 0 (disables resource saving for PostScript). 400K bytes through (400K bytes + value of MAXIMUM-RESOURCE-SAVING-MEMORY) in increments of 100K bytes. If a value is received that is greater than 0 and less than 400K bytes, it will be snapped to 400K bytes and a status of \u003cnoError\u003e will be returned. If an unsupported value greater than 400K bytes is received, it will be snapped down to the nearest 100K value and a status of \u003cnoError\u003e will be returned. Attempting to set this object when RESOURCE-SAVING is eAuto or eOff will cause a status of \u003cgenErr\u003e to be returned.",
    "maxaccess": "read-write",
    "name": "postscript_resource_saving_memory_size",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.4.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "print_density": {
    "class": "objecttype",
    "description": "Returns or sets the print density setting. Print density is the instantaneous amount of marking agent applied to the paper while printing. A value of zero has the lowest print density, yielding a lighter page. A value of 10 has the highest print density, yielding a darker page. Each POS should document what values in the 0 to 10 range are supported. Additional information: When this value is written, the page pipeline will be flushed (all pages being printed are completed, no new ones are started), the new density setting is set and printing resumes. The acutal change in print density may be gradual over several pages. The supported values are 1 through 5. Setting to an unsupported value causes the printer to substitue in a a snap value and to return \u003cnoError\u003e status. The snap values are as follows: \u003c1 snaps to 1 \u003e5 snaps to 5.",
    "maxaccess": "read-write",
    "name": "print_density",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 5,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "print_engine": {
    "class": "objectidentity",
    "name": "print_engine",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1"
  },
  "print_engine_jam_count": {
    "class": "objecttype",
    "description": "Total number of pages jammed in the print engine\u0027s life time. The POS indicates if the total jam count is kept in NVRAM and the maximum supported value before the jam count rolls over to zero. Additional information: This object is stored in NVRAM. The maximum value of this count is 65000 before it rolls over to zero.",
    "maxaccess": "read-write",
    "name": "print_engine_jam_count",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.2.34",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "print_engine_mispick_count": {
    "class": "objecttype",
    "description": "Total number of pages mispicked in the print engine\u0027s life time. The POS indicates if the total mispick count is kept in NVRAM and the maximum supported value before the mispick count rolls over to zero. Additional information: This object is stored in NVRAM. The maximum value of this count is 65000 before it rolls over to zero.",
    "maxaccess": "read-write",
    "name": "print_engine_mispick_count",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.2.35",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "print_internal_page": {
    "class": "objecttype",
    "description": "Writing this object to a value other than eNotPrintingAnInternalPage causes the device to attempt to print an internally generated page. Reading this object provides an indication what internally generated page is currently being printed, if any. The actual page is device specific. Some devices may support continuously printing an internally generated page. Setting this object to eNotPrintingAnInternalPage terminates continuously printing internally generated pages. An internally generated page may not be allowed to be printed at any arbitrary time; under what conditions it will succeed or fail is device specific. If the device supports the requested page, but can not start printing the page when requested, the device will respond with \u003cgenErr\u003e. RECOMMENDATION: If the device is ready (i.e. the NOT- READY-PRINTER object does not contain any items, except maybe being off-line) and is idle (i.e. the NOT-IDLE object does not contain any items), this request should always succeed. This provides a mechanism for driver writers to always determine if the action will succeed or not. Additional information: eDeviceDemoPage2 is the printer demo page. ePCLFontList1 is the PCL typeface list, ePostScriptFontList1 is the PostScript font list, and eDeviceDemoPage1ConfigurationPage is the selftest page. Laserjet 1200 does not support continuously printing a demo page. The printer will queue requests if it is currently busy. When this object is set to a valid value and the printer is idle, the status returned is \u003cnoError\u003e and the value returned is ePrintingAnUnknownInternalPage. Setting this object to a valid value causes the desired page to be formatted and put in the printer\u0027s print queue. While the page is being formatted, and the printer remains in a testing state, a get on this object will return the value ePrintingAnUnknownInternalPage. The return value will be eNotPrintingAnInternal page if the printer is not in a testing state, and the internal page is done being formatted. The user will not be able to set eNotPrintingAnInternalPage or ePrintingAnUnknownInternalPage, and the return status will be \u003cbadValue\u003e with a return value of eNotPrintingAnInternalPage. ePostScriptFontList1 will not be a valid value unless postscript is installed in the printer. If postscript is not installed and the user attempts to set ePostScriptFontList1, the return status will be \u003cbadValue\u003e with a return value of eNotPrintingAnInternalPage. Setting through DMCMD will cause a 15 second delay in printing.",
    "maxaccess": "read-write",
    "name": "print_internal_page",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.5.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eDeviceDemoPage1ConfigurationPage": 3,
          "eDeviceDemoPage2": 4,
          "eFileSystemDirectoryListing": 8,
          "eNotPrintingAnInternalPage": 1,
          "ePCLFontList1": 350,
          "ePostScriptFontList1": 450,
          "ePrintingAnUnknownInternalPage": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "printmib": {
    "class": "objectidentity",
    "name": "printmib",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2"
  },
  "processing_subsystem": {
    "class": "objectidentity",
    "name": "processing_subsystem",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3"
  },
  "prtAlert": {
    "class": "objectidentity",
    "name": "prtAlert",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18"
  },
  "prtAlertEntry": {
    "class": "objectidentity",
    "name": "prtAlertEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1"
  },
  "prtAlertTable": {
    "class": "objectidentity",
    "name": "prtAlertTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1"
  },
  "prtChannel": {
    "class": "objectidentity",
    "name": "prtChannel",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14"
  },
  "prtChannelEntry": {
    "class": "objectidentity",
    "name": "prtChannelEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1"
  },
  "prtChannelTable": {
    "class": "objectidentity",
    "name": "prtChannelTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1"
  },
  "prtConsoleDisplayBuffer": {
    "class": "objectidentity",
    "name": "prtConsoleDisplayBuffer",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.16"
  },
  "prtConsoleDisplayBufferEntry": {
    "class": "objectidentity",
    "name": "prtConsoleDisplayBufferEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.16.5.1"
  },
  "prtConsoleDisplayBufferTable": {
    "class": "objectidentity",
    "name": "prtConsoleDisplayBufferTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.16.5"
  },
  "prtConsoleLightEntry": {
    "class": "objectidentity",
    "name": "prtConsoleLightEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6.1"
  },
  "prtConsoleLightTable": {
    "class": "objectidentity",
    "name": "prtConsoleLightTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6"
  },
  "prtConsoleLights": {
    "class": "objectidentity",
    "name": "prtConsoleLights",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17"
  },
  "prtCover": {
    "class": "objectidentity",
    "name": "prtCover",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.6"
  },
  "prtCoverEntry": {
    "class": "objectidentity",
    "name": "prtCoverEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.6.1.1"
  },
  "prtCoverTable": {
    "class": "objectidentity",
    "name": "prtCoverTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.6.1"
  },
  "prtDeviceRefEntry": {
    "class": "objectidentity",
    "name": "prtDeviceRefEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.3.1"
  },
  "prtDeviceRefTable": {
    "class": "objectidentity",
    "name": "prtDeviceRefTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.3"
  },
  "prtGeneral": {
    "class": "objectidentity",
    "name": "prtGeneral",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5"
  },
  "prtGeneralEntry": {
    "class": "objectidentity",
    "name": "prtGeneralEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1"
  },
  "prtGeneralTable": {
    "class": "objectidentity",
    "name": "prtGeneralTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1"
  },
  "prtInput": {
    "class": "objectidentity",
    "name": "prtInput",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8"
  },
  "prtInputEntry": {
    "class": "objectidentity",
    "name": "prtInputEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1"
  },
  "prtInputTable": {
    "class": "objectidentity",
    "name": "prtInputTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2"
  },
  "prtInterpreter": {
    "class": "objectidentity",
    "name": "prtInterpreter",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15"
  },
  "prtInterpreterEntry": {
    "class": "objectidentity",
    "name": "prtInterpreterEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1"
  },
  "prtInterpreterTable": {
    "class": "objectidentity",
    "name": "prtInterpreterTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1"
  },
  "prtLocalization": {
    "class": "objectidentity",
    "name": "prtLocalization",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7"
  },
  "prtLocalizationEntry": {
    "class": "objectidentity",
    "name": "prtLocalizationEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7.1.1"
  },
  "prtLocalizationTable": {
    "class": "objectidentity",
    "name": "prtLocalizationTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7.1"
  },
  "prtMarker": {
    "class": "objectidentity",
    "name": "prtMarker",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10"
  },
  "prtMarkerEntry": {
    "class": "objectidentity",
    "name": "prtMarkerEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1"
  },
  "prtMarkerSupplies": {
    "class": "objectidentity",
    "name": "prtMarkerSupplies",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11"
  },
  "prtMarkerSuppliesEntry": {
    "class": "objectidentity",
    "name": "prtMarkerSuppliesEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1"
  },
  "prtMarkerSuppliesTable": {
    "class": "objectidentity",
    "name": "prtMarkerSuppliesTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1"
  },
  "prtMarkerTable": {
    "class": "objectidentity",
    "name": "prtMarkerTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2"
  },
  "prtMediaPath": {
    "class": "objectidentity",
    "name": "prtMediaPath",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13"
  },
  "prtMediaPathEntry": {
    "class": "objectidentity",
    "name": "prtMediaPathEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1"
  },
  "prtMediaPathTable": {
    "class": "objectidentity",
    "name": "prtMediaPathTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4"
  },
  "prtOutput": {
    "class": "objectidentity",
    "name": "prtOutput",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9"
  },
  "prtOutputEntry": {
    "class": "objectidentity",
    "name": "prtOutputEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1"
  },
  "prtOutputTable": {
    "class": "objectidentity",
    "name": "prtOutputTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2"
  },
  "prtStorageRefEntry": {
    "class": "objectidentity",
    "name": "prtStorageRefEntry",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.2.1"
  },
  "prtStorageRefTable": {
    "class": "objectidentity",
    "name": "prtStorageRefTable",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.2"
  },
  "prtalertallevents": {
    "class": "objecttype",
    "description": "A running counter of the total number of alert event entries (critical and non-critical) that have been recorded in the alert table Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This object is set to zero every time the printer is turned on. (It is not persistent through a power-cycle.)",
    "maxaccess": "read-only",
    "name": "prtalertallevents",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.19",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtalertcode": {
    "class": "objecttype",
    "description": "See associated textual convention PrtAlertCodeTC Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: ePother is returned for a variety of conditions, including: page punt, io buffer overflow, memory overflow, and warming up. ePcoverOpened is returned for both door open (top) and/or toner cartridge missing. ePinputMediaTrayMissing is returned when paper is out in all trays. And, ePinputMediaSupplyEmpty is returned for a paper prompt.",
    "maxaccess": "read-only",
    "name": "prtalertcode",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcoverOpened": 3,
          "ePinputMediaSupplyEmpty": 808,
          "ePinputMediaTrayMissing": 801,
          "ePjam": 8,
          "ePother": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "prtalertcriticalevents": {
    "class": "objecttype",
    "description": "A running counter of the number of critical alert events that have been recorded in the alert table. The value of this object is RESET in the event of a power cycle operation (i.e., the value is not persistent. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This object is set to zero every time the printer is turned on.",
    "maxaccess": "read-only",
    "name": "prtalertcriticalevents",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.18",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtalertdescription": {
    "class": "objecttype",
    "description": "A description of this alert entry in the localization specified by prtGeneralCurrentLocalization. The description is provided by the printer to further elaborate on the enumerated alert or provide information in the case where the code is classified as `other\u0027 or `unknown\u0027. The printer is required to return a description string but the string may be a null string. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtalertdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtalertgroup": {
    "class": "objecttype",
    "description": "The type of sub-unit within the printer model that this alert is related. Input, output, and markers are examples of printer model groups, i.e., examples of types of sub-units. Wherever possible, these enumerations match the sub-identifier that identifies the relevant table in the printmib. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtalertgroup",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePchannel": 14,
          "ePcover": 6,
          "ePgeneralPrinter": 5,
          "ePinput": 8,
          "ePmarker": 10,
          "ePoutput": 9
        }
      },
      "type": "INTEGER"
    }
  },
  "prtalertgroupindex": {
    "class": "objecttype",
    "description": "An index of the row within the principle table in the group identified by prtAlertGroup that represents the sub-unit of the printer that caused this alert. The combination of the prtAlertGroup and the prtAlertGroupIndex defines exactly which printer sub-unit caused the alert.; for example, Input #3, Output #2, and Marker #1. Every object in this MIB is indexed with hrDeviceIndex and optionally, another index variable. If this other index variable is present in the table that generated the alert, it will be used as the value for this object. Otherwise, this value shall be -1. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtalertgroupindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtalertlocation": {
    "class": "objecttype",
    "description": "The sub-unit location that is defined by the printer manufacturer to further refine the location of this alert within the designated sub-unit. The location is used in conjunction with the Group and GroupIndex values; for example, there is an alert in Input #2 at location number 7. The value (-2) indicates unknown Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtalertlocation",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtalertseveritylevel": {
    "class": "objecttype",
    "description": "The level of severity of this alert table entry. The printer determines the severity level assigned to each entry into the table. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtalertseveritylevel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcriticalBinaryChangeEvent": 3,
          "ePother": 1,
          "ePwarningBinaryChangeEvent": 5,
          "ePwarningUnaryChangeEvent": 4
        }
      },
      "type": "INTEGER"
    }
  },
  "prtalerttime": {
    "class": "objecttype",
    "description": "The value of sysUpTime at the time that this alert was generated. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This object is always zero.",
    "maxaccess": "read-only",
    "name": "prtalerttime",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtalerttraininglevel": {
    "class": "objecttype",
    "description": "See textual convention PrtAlertTrainingLevelTC Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value of this object depends on the alert condition as follows: ePuntrained: Paper low/out. ePtrained: Toner low. ePfieldService: Marker failure. ePmanagement: Configuration change.",
    "maxaccess": "read-only",
    "name": "prtalerttraininglevel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.18.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePfieldService": 5,
          "ePmanagement": 6,
          "ePnoInterventionRequired": 7,
          "ePother": 1,
          "ePtrained": 4,
          "ePunknown": 2,
          "ePuntrained": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtchannelcurrentjobcntllangindex": {
    "class": "objecttype",
    "description": "The value of prtInterpreterIndex corresponding to the Control Language Interpreter for this channel. This interpreter defines the syntax used for control functions, such as querying or changing environment variables and identifying job boundaries (e.g. PJL, PostScript, NPAP). Must be 1 or greater. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This object points to the PJL language. It is read-only because PJL is the printer\u0027s only job control language.",
    "maxaccess": "read-only",
    "name": "prtchannelcurrentjobcntllangindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtchanneldefaultpagedesclangindex": {
    "class": "objecttype",
    "description": "The value of prtInterpreterIndex corresponding to the Page Description Language Interpreter for this channel. This interpreter defines the default Page Description Language interpreter to be used for the print data unless the Control Language is used to select a specific interpreter (e.g., PCL, PostScript Language, auto-sense). Must be 1 or greater. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default points to the automatic language switcher. If this object is changed for one channel, all channels will be changed.",
    "maxaccess": "read-write",
    "name": "prtchanneldefaultpagedesclangindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtchannelifindex": {
    "class": "objecttype",
    "description": "The value of ifIndex (in the ifTable; see the interface section of MIB-2/RFC 1213) which corresponds to this channel. When more than one row of the ifTable is relevant, this is the index of the row representing the topmost layer in the interface hierarchy. A value of zero indicates that no interface is associated with this channel. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: EIO based channels provide their own values for this object.",
    "maxaccess": "read-only",
    "name": "prtchannelifindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtchannelinformation": {
    "class": "objecttype",
    "description": "Auxiliary information to allow a printing application to use the channel for data submission to the printer. An application capable of using a specific PrtChannelType should be able to use the combined information from the prtChannelInformation and other channel and interface group objects to \u0027bootstrap\u0027 its use of the channel. prtChannelInformation is not intended to provide a general channel description, nor to provide information that is available once the channel is in use. The encoding and interpretation of the prtChannelInformation object is specific to channel type. The description of each PrtChannelType enum value for which prtChannelInformation is defined specifies the appropriate encoding and interpretation, including interaction with other objects. For channel types that do not specify a prtChannelInformation value, its value shall be null (0 length). When a new PrtChannelType enumeration value is registered, its accompanying description must specify the encoding and interpretation of the prtChannelInformation value for the channel type. prtChannelInformation semantics for an existing PrtChannelType may be added or amended in the same manner as described in section 2.4.1 for type 2 enumeration values. The prtChannelInformation specifies values for a collection of channel attributes, represented as text according to the following rules: 1. The prtChannelInformation is coded in the NVT ASCII character set. It is not affected by localization. 2. The prtChannelInformation is a list of entries representing the attribute values. Each entry consists of the following items, in order: a. a keyword, composed of alphabetic characters (A-Z, a-z), that identifies a channel attribute, b. an Equals Sign (=) to delimit the keyword, c. a data value, consisting of NVT ASCII graphics characters (codes 32-126), d. a Line Feed character (code 10) to delimit the data value. No other characters shall be present. Keywords are case-sensitive. Conventionally, keywords are capitalized (including each word of a multi-word keyword), and, since they occupy space in the prtChannelInformation, they are kept short. 3. If a channel attribute has multiple values, it is represented by multiple entries with the same keyword, each specifying one value. Otherwise, there shall be at most one entry for each attribute. 4. By default, entries may appear in any order. If there are ordering constraints for particular entries, these must be specified in their definitions. 5. The prtChannelInformation value may represent information that is not normally coded in textual form, or that is coded in a character set other than NVT ASCII. In these cases, whatever symbolic representation is conventionally used for the information should be used for encoding the prtChannelInformation. (For instance, a binary port value might be represented as a decimal number, Unicode would be represented in UTF-8 format.) 6. For each PrtChannelType for which prtChannelInformation entries are defined, the descriptive text associated with the PrtChannelType enumeration value shall specify the following information for each entry: Title: Brief description phrase, e.g.: \u0027Port name\u0027, \u0027Service Name\u0027, Keyword: The keyword value, eg: \u0027Port\u0027, \u0027Service\u0027 Syntax: The encoding of the entry value, if it cannot be directly represented by NVT ASCII, Status: \u0027Mandatory\u0027, \u0027Optional\u0027, or \u0027Conditionally Mandatory\u0027, Multiplicity: \u0027Single\u0027 or \u0027Multiple\u0027, to indicate whether the entry may be present multiple times, Description: Description of the use of the entry, other information required to complete the definition (e.g.: ordering contstraints, interactions between entries). Applications that interpret prtChannelInformation should ignore unrecognized entries, so they are not affected if new entry types are added. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: EIO-based channels provide their own values for this object.",
    "maxaccess": "read-only",
    "name": "prtchannelinformation",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtchannelprotocolversion": {
    "class": "objecttype",
    "description": "The version of the protocol used on this channel. The format used for version numbering depends on prtChannelType. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: EIO based channels provide their own values. The channel 1 value includes (separated by semi colons) different aspects of the spec: electrical: logical: and physical connector.",
    "maxaccess": "read-only",
    "name": "prtchannelprotocolversion",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtchannelstate": {
    "class": "objecttype",
    "description": "The state of this print data channel. The value determines whether control information and print data is allowed through this channel or not. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: EIO based channels provide their own values for this object. The base-printer\u0027s ports always report a value of ePprintDataAccepted. If the printer is offline, that is detected by reading the Host Resources General Printer Status objects, not by reading this object.",
    "maxaccess": "read-only",
    "name": "prtchannelstate",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePnoDataAccepted": 4,
          "ePother": 1,
          "ePprintDataAccepted": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtchannelstatus": {
    "class": "objecttype",
    "description": "The current status of the channel. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: IIO based channels provide their own values for this object.",
    "maxaccess": "read-only",
    "name": "prtchannelstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtchanneltype": {
    "class": "objecttype",
    "description": "The type of this print data channel. This object provides the linkage to ChannelType-specific groups that may (conceptually) extend the prtChannelTable with additional details about that channel. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: EIO based channels provide their own values.",
    "maxaccess": "read-only",
    "name": "prtchanneltype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.14.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePchAppleTalkPAP": 7,
          "ePchBidirPortTCP": 38,
          "ePchDLCLLCPort": 15,
          "ePchIEEE1284Port": 5,
          "ePchIrDA": 35,
          "ePchNetwarePServer": 10,
          "ePchPort9100": 11,
          "ePchUSB": 34,
          "ePother": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "prtconsolecolor": {
    "class": "objecttype",
    "description": "The color of this light. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtconsolecolor",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePblue": 6,
          "ePcyan": 7,
          "ePgreen": 5,
          "ePmagenta": 8,
          "ePother": 1,
          "ePred": 4,
          "ePunknown": 2,
          "ePwhite": 3,
          "ePyellow": 9
        }
      },
      "type": "INTEGER"
    }
  },
  "prtconsoledescription": {
    "class": "objecttype",
    "description": "The vendor description or label of this light in the localization specified by prtConsoleLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtconsoledescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtconsoledisable": {
    "class": "objecttype",
    "description": "If the object prtConsoleDisable has value \u0027operatorConsoleDisabled\u0027 then input is not accepted from the operator console. If the object prtConsoleDisable has the value \u0027operatorConsoleEnabled\u0027 then input is accepted from the operator console. If the object prtConsoleDisable has the value \u0027operatorConsoleEnabledLevel1\u0027,\u0027operatorConsoleEnabledLevel2\u0027 or \u0027operatorConsoleEnabledLevel3\u0027 then limited input is accepted from the operator console; the limitations are product specific, however, the limitations are generally less restrictive for operatorConsoleEnabledLevel1 than for operatorConsoleEnabledLeve2, which is less restrictive than operatorConsoleEnabledLevel3. The value of the prtConsoleDisable object is a type-2 enumeration. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product have no display.",
    "maxaccess": "read-only",
    "name": "prtconsoledisable",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePoperatorConsoleDisabled": 4,
          "ePoperatorConsoleEnabled": 3,
          "ePoperatorConsoleEnabledLevel1": 5,
          "ePoperatorConsoleEnabledLevel2": 6,
          "ePoperatorConsoleEnabledLevel3": 7
        }
      },
      "type": "INTEGER"
    }
  },
  "prtconsoledisplaybuffertext": {
    "class": "objecttype",
    "description": "The content of a line in the logical display buffer of the operator\u0027s console of the printer. When a write operation occurs, normally a critical message, to one of the LineText strings, the agent should make that line displayable if a physical display is present. Writing a zero length string clears the line. It is an implementation-specific matter as to whether the agent allows a line to be overwritten before it has been cleared. Printer generated strings shall be in the localization specified by prtConsoleLocalization. Management Application generated strings should be localized by the Management Application. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtconsoledisplaybuffertext",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.16.5.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtconsolelocalization": {
    "class": "objecttype",
    "description": "The value of the prtLocalizationIndex corresponding to the language, country, and character set to be used for the console. This localization applies both to the actual display on the console as well as the encoding of these console objects in management operations. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has no display.",
    "maxaccess": "read-write",
    "name": "prtconsolelocalization",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 1,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtconsolenumberofdisplaychars": {
    "class": "objecttype",
    "description": "The number of characters per line displayed on the physical display. This value is 0 if there are no lines on the physical display or if there is no physical display Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has no display, however this object can be used to determine the size of the remote control panel display for prtConsoleDisplayBufferText.",
    "maxaccess": "read-only",
    "name": "prtconsolenumberofdisplaychars",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtconsolenumberofdisplaylines": {
    "class": "objecttype",
    "description": "The number of lines on the printer\u0027s physical display. This value is 0 if there are no lines on the physical display or if there is no physical display Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has no display, however this object can be used to determine the size of the remote control panel display for prtConsoleDisplayBufferText.",
    "maxaccess": "read-only",
    "name": "prtconsolenumberofdisplaylines",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtconsoleofftime": {
    "class": "objecttype",
    "description": "This object, in conjunction with prtConsoleOnTime, defines the current status of the light. If both prtConsoleOnTime and prtConsoleOffTime are non-zero, the lamp is blinking and the values presented define the on time and off time, respectively, in milliseconds. If prtConsoleOnTime is zero and prtConsoleOffTime is non-zero, the lamp is off. If prtConsoleOffTime is zero and prtConsoleOnTime is non-zero, the lamp is on. If both values are zero the status of the lamp is undefined. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: There are three control panel LEDs: Attention, Ready, and Go. When an LED blinks, it is on for one half second and off for one half second. The value used for this object is 500 when the LED is off or blinking, otherwise it is zero. When the LEDs are in a cycling state the value of this object for all LEDs is zero and the value for prtConsoleOnTime for all LEDs is zero.",
    "maxaccess": "read-only",
    "name": "prtconsoleofftime",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtconsoleontime": {
    "class": "objecttype",
    "description": "This object, in conjunction with prtConsoleOffTime, defines the current status of the light. If both prtConsoleOnTime and prtConsoleOffTime are non-zero, the lamp is blinking and the values presented define the on time and off time, respectively, in milliseconds. If prtConsoleOnTime is zero and prtConsoleOffTime is non-zero, the lamp is off. If prtConsoleOffTime is zero and prtConsoleOnTime is non-zero, the lamp is on. If both values are zero the status of the lamp is undefined. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: There are three control panel LEDs: Attention, Ready, and Go. When an LED blinks, it is on for one half second and off for one half second. The value used for this object is 500 when the LED is on or blinking, otherwise it is zero. When the LEDs are in a cycling state the value of this object for all LEDs is zero and the value for prtConsoleOffTime for all LEDs is zero.",
    "maxaccess": "read-only",
    "name": "prtconsoleontime",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.17.6.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtcoverdescription": {
    "class": "objecttype",
    "description": "The manufacturer provided cover sub-mechanism name in the localization specified by prtGeneralCurrentLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtcoverdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.6.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtcoverstatus": {
    "class": "objecttype",
    "description": "The status of this cover sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtcoverstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.6.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePdoorClosed": 4,
          "ePdoorOpen": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtdevicerefindex": {
    "class": "objecttype",
    "description": "The value of the hrDeviceIndex of the printer device that this deviceEntry is associated with. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtdevicerefindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.3.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtgeneralconfigchanges": {
    "class": "objecttype",
    "description": "Counts configuration changes that change the capabilities of a printer, such as the addition/deletion of input/output bins, the addition/deletion of interpreters, or changes in media size. Such changes will often affect the capability of the printer to service certain types of print jobs. Management applications may cache infrequently changed configuration information about sub-units on the printer. This object should be incremented whenever the agent wishes such applications to invalidate that cache and re-download all of this configuration information, thereby signaling a change in the printer\u0027s configuration. For example, if an input tray that contained paper of different dimensions was added, this counter would be incremented. As an additional example, this counter would not be incremented when an input tray is removed or the level of an input device changes. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This is a 32 bit counter (unsigned). When it reaches its maximum value, it will roll to zero.",
    "maxaccess": "read-only",
    "name": "prtgeneralconfigchanges",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtgeneralcurrentlocalization": {
    "class": "objecttype",
    "description": "The value of the prtLocalizationIndex corresponding to the current language, country, and character set to be used for localized string values that are identified as being dependent on the value of this object. Note that this object does not apply to localized strings in the prtConsole group or to any object that is not explicitly identified as being localized according to prtGeneralCurrentLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value of this object is saved in NVRAM.",
    "maxaccess": "read-write",
    "name": "prtgeneralcurrentlocalization",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 1,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtgeneralcurrentoperator": {
    "class": "objecttype",
    "description": "The name of the person who is responsible for operating this printer. It is suggested that this string include information that would enable other humans to reach the operator, such as a phone number. As a convention to facilitate automatic notification of the operator by the agent or the network management station, the phone number, fax number or email address should be placed on a separate line starting with ASCII LF (hex 0x0A) and the ASCII text string (without the quotes): \u0027phone: \u0027, \u0027fax: \u0027, and \u0027email: \u0027, respectively. Phone numbers may contain digits, whitespace and parentheses, which shall be ignored. Phone numbers may also include ASCII comma characters(hex 2C) that are used to indicate a two-second pause during the dialing sequence. If either the phone, fax, or email information is not available, then a line should not be included for this information. NOTE: For interoperability purposes, it is advisable to use email addresses formatted according to RFC 822 requirements. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The maximum supported string length is 32 characters. Length of 32 was chosen so a phone number could be included with the name. If the user entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e status.",
    "maxaccess": "read-write",
    "name": "prtgeneralcurrentoperator",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 32,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtgeneralprintername": {
    "class": "objecttype",
    "description": "An administrator-specified name for this printer. Depending upon implementation of this printer, the value of this object may or may not be same as the value for the MIB-II \u0027SysName\u0027 object. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The maximum supported string length is 32 characters. Length of 32 was chosen so a phone number could be included with the name. If the user-entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e status. The value of this object is saved over a power cycle.",
    "maxaccess": "read-write",
    "name": "prtgeneralprintername",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.16",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 32,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtgeneralreset": {
    "class": "objecttype",
    "description": "Setting this value to `powerCycleReset\u0027, `resetToNVRAM\u0027, or `resetToFactoryDefaults\u0027 will result in the resetting of the printer. When read, this object will always have the value `notResetting(3)\u0027, and a SET of the value `notResetting\u0027 shall have no effect on the printer. Some of the defined values are optional. However, every implementation must support at least the values `notResetting\u0027 and \u0027resetToNVRAM\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product supports the values \u0027notResetting\u0027 and \u0027resetToNVRAM\u0027. Setting this object to ePnotResetting causes the printer to do no reset. Setting this object to \u0027resetToNVRAM\u0027 causes the Laserjet 1200 product to perform its power on initialization routines. All I/O buffers are reset and tests normally run at power on time are executed.",
    "maxaccess": "read-write",
    "name": "prtgeneralreset",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePnotResetting": 3,
          "ePresetToNVRAM": 5
        }
      },
      "type": "INTEGER"
    }
  },
  "prtgeneralserialnumber": {
    "class": "objecttype",
    "description": "A recorded serial number for this device that indexes some type device catalog or inventory. This value is usually set by the device manufacturer but the MIB supports the option of writeability for this object for site-specific administration of device inventory or tracking. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtgeneralserialnumber",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.17",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 11,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtgeneralserviceperson": {
    "class": "objecttype",
    "description": "The name of the person responsible for servicing this printer. It is suggested that this string include information that would enable other humans to reach the service person, such as a phone number. As a convention to facilitate automatic notification of the service person by the agent or a network management station, the phone number, fax number or email address should be placed on a separate line starting with ASCII LF (hex 0x0A) and the ASCII text string (without the quotes): \u0027phone: \u0027, \u0027fax: \u0027, and \u0027email: \u0027, respectively. Phone numbers may contain digits, whitespace and parentheses, which shall be ignored. Phone numbers can also include one or more ASCII comma characters(hex 2C) to indicate a two-second pause during the dialing sequence. If either the phone,fax, or email information is not available, then a line should not included for this information. NOTE: For interoperability purposes, it is advisable to use email addresses formatted according to RFC 822 requirements. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The maximum supported string length is 32 characters. Length of 32 was chosen so a phone number could be included with the name. If the user entered string is too long, the device will store as much as possible and will return the \u003cnoError\u003e status.",
    "maxaccess": "read-write",
    "name": "prtgeneralserviceperson",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 32,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputcapacityunit": {
    "class": "objecttype",
    "description": "The unit of measurement for use in calculating and relaying capacity values for this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: A sheet is a single piece of 20 pound paper. ",
    "maxaccess": "read-only",
    "name": "prtinputcapacityunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePsheets": 8
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinputcurrentlevel": {
    "class": "objecttype",
    "description": "The current capacity of the input sub-unit in input sub-unit capacity units (PrtCapacityUnitTC). If this input sub-unit can reliably sense this value, the value is sensed by the printer and may not be changed by management requests; otherwise, the value may be written (by a Remote Contol Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. The value (-3) means that the printer knows that at least one unit remains. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 products can only detect empty/not empty in its trays. It returns -3 for not empty and -2 (unknown) for any other condition (e.g. tray is empty or tray is removed).",
    "maxaccess": "read-only",
    "name": "prtinputcurrentlevel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputdefaultindex": {
    "class": "objecttype",
    "description": "The value of prtInputIndex corresponding to the default input sub-unit: that is, this object selects the default source of input media. This value shall be -1 if there is no default input subunit specified for the printer as a whole. In this case, the actual default input subunit may be specified by means outside the scope of this MIB, such as by each interpreter in a printer with multiple interpreters. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default input tray is determined by the printer based on DEFAULT-MEDIA-SIZE. See the \u00274 Pack Paper Handling ERS\u0027 for complete details. This object always returns -1, unknown.",
    "maxaccess": "read-only",
    "name": "prtinputdefaultindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputdescription": {
    "class": "objecttype",
    "description": "A free-form text description of this input sub-unit in the localization specified by prtGeneralCurrentLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinputdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.18",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputdimunit": {
    "class": "objecttype",
    "description": "The unit of measurement for use calculating and relaying dimensional values for this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Following is a table of paper sizes and dimensions for each paper size supported by the Laserjet 1200 product: Size....................Inches(ten-thousandths)...Micrometers ----------------------------------------------------------------- eUSExecutive............72500 x 105000............184150 x 266700 eUSLetter...............85000 x 110000............215900 x 279400 eUSLegal................85000 x 140000............215900 x 355600 eFoolscap...............85000 x 130000............215900 x 330200 eROC16K.................77500 x 107500............196850 x 273050 eISOandJISA4............82677 x 116929............210000 x 297000 eISOandJISA5............58286 x 82677.............148000 x 210000 eJISB5..................71654 x 101181............182000 x 257000 eJapanesePostcardSingle.39370 x 58267.............100000 x 148000 eJapanesePostcardDouble.58267 x 78740.............148000 x 200000 eMonarch................38750 x 75000.............98425 x 190500 eCommercial10...........41250 x 95000.............104775 x 241300 eInternationalDL........43307 x 86614.............110000 x 120000 eInternationalC5........63780 x 90157.............162000 x 229000 eInternationalB5........69291 x 98425.............176000 x 250000 eCustom.................85000 x 140000(max).......215900 x 355600(max)",
    "maxaccess": "read-only",
    "name": "prtinputdimunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePmicrometers": 4,
          "ePtenThousandthsOfInches": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinputmaxcapacity": {
    "class": "objecttype",
    "description": "The maximum capacity of the input sub-unit in input sub-unit capacity units (PrtCapacityUnitTC). There is no convention associated with the media itself so this value reflects claimed capacity. If this input sub-unit can reliably sense this value, the value is sensed by the printer and may not be changed by management requests; otherwise, the value may be written (by a Remote Control Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This is specified assuming 20 pound paper for the paper trays.",
    "maxaccess": "read-only",
    "name": "prtinputmaxcapacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputmediadimfeeddirchosen": {
    "class": "objecttype",
    "description": "The printer will act as if media of the chosen dimension (in the feed direction) is present in this input source. Note that this value will be used even if the input tray is empty. Feed dimension measurements are taken relative to the feed direction associated with that sub-unit and are in input sub-unit dimensional units (MediaUnit). If the printer supports the declared dimension, the granted dimension is the same as the declared dimension. If not, the granted dimension is set to the closest dimension that the printer supports when the declared dimension is set. The value (-1) means other and specifically indicates that this sub-unit places no restriction on this parameter. The value (-2) indicates unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: When the tray is removed, a value of -2 is returned. The default values assume the trays are configured for letter size paper. The object for tray 1 returns the value of the media size for which the tray is currently configured because they cannot sense what size media it contains.",
    "maxaccess": "read-only",
    "name": "prtinputmediadimfeeddirchosen",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputmediadimfeeddirdeclared": {
    "class": "objecttype",
    "description": "This object provides the value of the declared dimension, in the feed direction, of the media that is (or, if empty, was or will be) in this input sub-unit. The feed direction is the direction in which the media is fed on this sub-unit. This dimension is measured in input sub-unit dimensional units (prtInputDimUnit). If this input sub-unit can reliably sense this value, the value is sensed by the printer and may not be changed by management requests. Otherwise, the value may be changed. The value (-1) means other and specifically means that this sub-unit places no restriction on this parameter. The value (-2) indicates unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default values assume the trays are configured for letter size paper. For tray 1 the value is the dimension for the media size currently declared. Valid values are 63000 to 140000 if prtInputDimUnit is ePtenThousandthsOfInches and 160000 to 356000 if prtInputDimUnit is ePmicrometers.",
    "maxaccess": "read-only",
    "name": "prtinputmediadimfeeddirdeclared",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputmediadimxfeeddirchosen": {
    "class": "objecttype",
    "description": "The printer will act as if media of the chosen dimension (in the cross feed direction) is present in this input source. Note that this value will be used even if the input tray is empty. The cross feed direction is ninety degrees relative to the feed direction associated with this sub-unit. This dimension is measured in input sub-unit dimensional units (MediaUnit). If the printer supports the declared dimension, the granted dimension is the same as the declared dimension. If not, the granted dimension is set to the closest dimension that the printer supports when the declared dimension is set. The value (-1) means other and specifically indicates that this sub-unit places no restriction on this parameter. The value (-2) indicates unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default values assume the trays are configured for letter size paper. The objects for tray 1, tray 2 and tray 3 returns the value of the media size for which the tray is currently configured because they cannot sense what size media it contains.",
    "maxaccess": "read-only",
    "name": "prtinputmediadimxfeeddirchosen",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputmediadimxfeeddirdeclared": {
    "class": "objecttype",
    "description": "This object provides the value of the declared dimension, in the cross feed direction, of the media that is (or, if empty, was or will be) in this input sub-unit. The cross feed direction is ninety degrees relative to the feed direction associated with this sub-unit. This dimension is measured in input sub-unit dimensional units (prtInputDimUnit). If this input sub-unit can reliably sense this value, the value is sensed by the printer and may not be changed by management requests. Otherwise, the value may be changed. The value (-1) means other and specifically means that this sub-unit places no restriction on this parameter. The value (-2) indicates unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default values assume the trays are configured for letter size paper. For tray 1 the value is the dimension for the media size currently declared. Valid values are 35000 to 85000 if prtInputDimUnit is ePtenThousandthsOfInches and 90000 to 216000 if prtInputDimUnit is ePmicrometers.",
    "maxaccess": "read-only",
    "name": "prtinputmediadimxfeeddirdeclared",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputmedianame": {
    "class": "objecttype",
    "description": "A description of the media contained in this input sub-unit; This description is intended for display to a human operator. This description is not processed by the printer. It is used to provide information not expressible in terms of the other media attributes (e.g. prtInputMediaDimFeedDirChosen, prtInputMediaDimXFeedDirChosen, prtInputMediaWeight, prtInputMediaType). An example would be `legal tender bond paper\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product does not support the concept of named media types.",
    "maxaccess": "read-only",
    "name": "prtinputmedianame",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputmodel": {
    "class": "objecttype",
    "description": "The model name of this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product does not specify a model name for Tray1.",
    "maxaccess": "read-only",
    "name": "prtinputmodel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.15",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputname": {
    "class": "objecttype",
    "description": "The name assigned to this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinputname",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputsecurity": {
    "class": "objecttype",
    "description": "Indicates if this input sub-unit has some security associated with it. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: No security mechanism provided.",
    "maxaccess": "read-only",
    "name": "prtinputsecurity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.19",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePnotPresent": 5,
          "ePoff": 4,
          "ePon": 3,
          "ePother": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinputserialnumber": {
    "class": "objecttype",
    "description": "The serial number assigned to this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product does not specify a serial number for the input trays.",
    "maxaccess": "read-only",
    "name": "prtinputserialnumber",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.17",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 32,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputstatus": {
    "class": "objecttype",
    "description": "The current status of this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default value assumes that media is loaded in the tray. When there is not media loaded in the tray it returns 9 instead of 0 (the default). Default - 0 (Available and Idle) paper motion - 6 (Available and Busy) paper out in this tray - 9 (Non-Critical Alert(8) + Unavailable and OnRequest(1)) paper mount in this tray - 48 (Critical Alert (16) + OffLine (32)) manual feed prompt (PaperMount) - 48 (Critical Alert (16) + OffLine (32))",
    "maxaccess": "read-only",
    "name": "prtinputstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinputtype": {
    "class": "objecttype",
    "description": "The type of technology (discriminated primarily according to feeder mechanism type) employed by the input sub-unit. Note, the Optional Input Class provides for a descriptor field to further qualify the other choice. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Tray 1 is the multi-purpose tray and is always present. It supports both sheets and envelopes. Its type is ePsheetFeedAutoNonRemovableTray.",
    "maxaccess": "read-only",
    "name": "prtinputtype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePsheetFeedAutoNonRemovableTray": 4,
          "ePsheetFeedAutoRemovableTray": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinputvendorname": {
    "class": "objecttype",
    "description": "The vendor name of this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinputvendorname",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.14",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinputversion": {
    "class": "objecttype",
    "description": "The version of this input sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product do not specify a version number for the input trays.",
    "maxaccess": "read-only",
    "name": "prtinputversion",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.8.2.1.16",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 63,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinterpreterdefaultcharsetin": {
    "class": "objecttype",
    "description": "The default coded character set for input octets encountered outside a context in which the Page Description Language established the interpretation of the octets. (Input octets are presented to the interpreter through a path defined in the channel group.) This value shall be (2) if there is no default. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: ePcsAdobeStandardEncoding is the same as PSText(10J). The object corresponding to PCL has read-write acces; all others are read-only. the above list corresponds to the following symbol sets as they appear on the Control Panel: ePother( 1) - used if designated coded char. set not in list ePcsASCII( 3) - ISO-6 ePcsISOLatin1( 4) - ISO L1 ePcsISOLatin2( 5) - IS L2 ePcsISOLatin5( 12) - ISO L5 ePcsISOLatin6( 13) - ISO L6 ePcsISO4UnitedKingdom( 20) - ISO-4 ePcsISO11SwedishforNames( 21) - ISO-11 ePcsISO15Italian( 22) - ISO-15 ePcsISO17Spanish( 23) - ISO-17 ePcsISO21German( 24) - ISO-21 ePcsISO60DanishNorwegian( 25) - ISO-60 ePcsISO69French( 26) - ISO-69 ePcsUnicodeIBM2039(1004) - PC-1004 ePcsWindows30Latin1( 2000) - WIN 3.0 ePcsWindows31Latin1( 2001) - WIN L1 ePcsWindows31Latin2( 2002) - WIN L2 ePcsWindows31Latin5( 2003) - WIN L5 ePcsHPRoman8( 2004) - ROMAN-8 ePcsAdobeStandardEncoding( 2005) - PS TEXT ePcsPC850Multilingual( 2009) - PC-850 ePcsPCp852( 2010) - PC-852 ePcsPC8CodePage437( 2011) - PC-8 ePcsPC8DNDanishNorwegian( 2012) - PC-8DN ePcsHPPC8Turkish( 2014) - PC-8 TK ePcsHPLegal( 2017) - LEGAL ePcsHPDeskTop( 2021) - DESKTOP ePcsMacintosh(2027) - MC TEXT",
    "maxaccess": "read-write",
    "name": "prtinterpreterdefaultcharsetin",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcsASCII": 3,
          "ePcsAdobeStandardEncoding": 2005,
          "ePcsHPDeskTop": 2021,
          "ePcsHPLegal": 2017,
          "ePcsHPPC8Turkish": 2014,
          "ePcsHPRoman8": 2004,
          "ePcsISO11SwedishforNames": 21,
          "ePcsISO15Italian": 22,
          "ePcsISO17Spanish": 23,
          "ePcsISO21German": 24,
          "ePcsISO4UnitedKingdom": 20,
          "ePcsISO60DanishNorwegian": 25,
          "ePcsISO69French": 26,
          "ePcsISOLatin1": 4,
          "ePcsISOLatin2": 5,
          "ePcsISOLatin5": 12,
          "ePcsISOLatin6": 13,
          "ePcsMacintosh": 2027,
          "ePcsPC850Multilingual": 2009,
          "ePcsPC8CodePage437": 2011,
          "ePcsPC8DNDanishNorwegian": 2012,
          "ePcsPCp852": 2010,
          "ePcsUnicodeIBM2039": 1004,
          "ePcsWindows30Latin1": 2000,
          "ePcsWindows31Latin1": 2001,
          "ePcsWindows31Latin2": 2002,
          "ePcsWindows31Latin5": 2003,
          "ePother": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinterpreterdefaultcharsetout": {
    "class": "objecttype",
    "description": "The default character set for data coming from this interpreter through the printer\u0027s output channel (i.e. the \u0027backchannel\u0027). This value shall be (2) if there is no default. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinterpreterdefaultcharsetout",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcsASCII": 3,
          "ePcsAdobeStandardEncoding": 2005,
          "ePcsHPRoman8": 2004,
          "ePcsNoDefault": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinterpreterdefaultorientation": {
    "class": "objecttype",
    "description": "The current orientation default for this interpreter. This value may be overridden for a particular job (e.g., by a command in the input data stream). Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Interpreters 1 and 2 ignore the value of this object. The values for PCL and PostScript are either ePportrait or ePlandscape; attempting to set them to a different value will cause \u003cbadValue\u003e to be returned. Setting this object for one interpreter will change it for all installed interpreters.",
    "maxaccess": "read-write",
    "name": "prtinterpreterdefaultorientation",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePlandscape": 4,
          "ePportrait": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinterpreterdescription": {
    "class": "objecttype",
    "description": "A string to identify this interpreter in the localization specified by prtGeneralCurrentLocalization as opposed to the language which is being interpreted. It is anticipated that this string will allow manufacturers to unambiguously identify their interpreters. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: None of these strings are localized.",
    "maxaccess": "read-only",
    "name": "prtinterpreterdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinterpreterfeedaddressability": {
    "class": "objecttype",
    "description": "The maximum interpreter addressability in the feed direction in 10000 prtMarkerAddressabilityUnits (see prtMarkerAddressabilityFeedDir ) for this interpreter. The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinterpreterfeedaddressability",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtinterpreterlangfamily": {
    "class": "objecttype",
    "description": "The family name of a Page Description Language (PDL) or control language which this interpreter in the printer can interpret or emulate. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: ePlangAutomatic refers to the \u0027super-language\u0027 made available by implicit language switching.",
    "maxaccess": "read-only",
    "name": "prtinterpreterlangfamily",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePlangAutomatic": 37,
          "ePlangPCL": 3,
          "ePlangPCLXL": 47,
          "ePlangPJL": 5,
          "ePlangPS": 6,
          "ePother": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinterpreterlanglevel": {
    "class": "objecttype",
    "description": "The level of the language which this interpreter is interpreting or emulating. This might contain a value like \u00275e\u0027 for an interpreter which is emulating level 5e of the PCL language. It might contain \u00272\u0027 for an interpreter which is emulating level 2 of the PostScript language. Similarly it might contain \u00272\u0027 for an interpreter which is emulating level 2 of the HPGL language. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinterpreterlanglevel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 31,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinterpreterlangversion": {
    "class": "objecttype",
    "description": "The date code or version of the language which this interpreter is interpreting or emulating. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: These values are derived from the dateCode field of the personality entities. (ePlangautomatic uses the PJL dateCode.) For PostScript, this is more detailed revision information.",
    "maxaccess": "read-only",
    "name": "prtinterpreterlangversion",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 31,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinterpretertwoway": {
    "class": "objecttype",
    "description": "Indicates whether or not this interpreter returns information back to the host. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinterpretertwoway",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePno": 4,
          "ePyes": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtinterpreterversion": {
    "class": "objecttype",
    "description": "The date code, version number, or other product specific information tied to this interpreter. This value is associated with the interpreter, rather than with the version of the language which is being interpreted or emulated. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Same as prtInterpreterLangVersion.",
    "maxaccess": "read-only",
    "name": "prtinterpreterversion",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 31,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtinterpreterxfeedaddressability": {
    "class": "objecttype",
    "description": "The maximum interpreter addressability in the cross feed direction in 10000 prtMarkerAddressabilityUnits (see prtMarkerAddressabilityXFeedDir) for this interpreter. The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtinterpreterxfeedaddressability",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.15.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtlocalizationcharacterset": {
    "class": "objecttype",
    "description": "The coded character set used for this localization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtlocalizationcharacterset",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcsHPRoman8": 2004
        }
      },
      "type": "INTEGER"
    }
  },
  "prtlocalizationcountry": {
    "class": "objecttype",
    "description": "A two character country code from ISO 3166, a blank string (two space characters) shall indicate that the country is not defined. Examples: US, FR, DE, ... Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The languages supported by the Laserjet 1200 product (and corresponding country) are English (US, United States)",
    "maxaccess": "read-only",
    "name": "prtlocalizationcountry",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 2,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtlocalizationlanguage": {
    "class": "objecttype",
    "description": "A two character language code from ISO 639. Examples en, gb, ca, fr, de. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The languages supported by the Laserjet 1200 product English",
    "maxaccess": "read-only",
    "name": "prtlocalizationlanguage",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.7.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 2,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtmarkeraddressabilityfeeddir": {
    "class": "objecttype",
    "description": "The maximum number of addressable marking positions in the feed direction per 10000 units of measure specified by prtMarkerAddressabilityUnit. A value of (-1) implies \u0027other\u0027 or \u0027infinite\u0027 while a value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Use this object to specify resolution. The Laserjet 1200 product support 300, 600, or 1200 dots per inch with 1200 being the default. If this object changes it causes prtMarkerAddressabilityXFeedDir object to change to the same value.",
    "maxaccess": "read-only",
    "name": "prtmarkeraddressabilityfeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkeraddressabilityunit": {
    "class": "objecttype",
    "description": "The unit of measure of distances, as applied to the marker\u0027s resolution. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This will always be ePtenThousandthsOfInches, no matter what COLD-RESET-MEDIA-SIZE is because we are talking about resolution and toner addressability, which is always dpi.",
    "maxaccess": "read-only",
    "name": "prtmarkeraddressabilityunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePtenThousandthsOfInches": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkeraddressabilityxfeeddir": {
    "class": "objecttype",
    "description": "The maximum number of addressable marking positions in the cross feed direction in 10000 units of measure specified by prtMarkerAddressabilityUnit. A value of (-1) implies \u0027other\u0027 or \u0027infinite\u0027 while a value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Use this object to specify resolution. The Laserjet 1200 product support 300, 600, or 1200 dots per inch with 1200 being the default. If this object changes it causes prtMarkerAddressabilityFeedDir object to change to the same value.",
    "maxaccess": "read-only",
    "name": "prtmarkeraddressabilityxfeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkercounterunit": {
    "class": "objecttype",
    "description": "The unit that will be used by the printer when reporting counter values for this marking sub-unit. The time units of measure are provided for a device like a strip recorder that does not or cannot track the physical dimensions of the media and does not use characters, lines or sheets. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Since the Laserjet 1200 product keeps track of pages printed, the counter unit will be defined as ePimpressions which would be like saying pages printed. (The term \u0027impressions\u0027 is used instead of \u0027pages\u0027 to avoid confusion between \u0027sheets\u0027 and \u0027pages\u0027 on a duplexing printer. This confusion isn\u0027t a problem with the Laserjet 1200 product because it has no duplexer.)",
    "maxaccess": "read-only",
    "name": "prtmarkercounterunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePimpressions": 7
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkerdefaultindex": {
    "class": "objecttype",
    "description": "The value of prtMarkerIndex corresponding to the default marker sub-unit; that is, this object selects the default marker. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product only has one marker subunit.",
    "maxaccess": "read-only",
    "name": "prtmarkerdefaultindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmarkereastmargin": {
    "class": "objecttype",
    "description": "The margin from the East edge (see prtMarkerNorthMargin) of the medium in units identified by prtMarkerAddressabilityUnit. Printing within the area bounded by all four margins is guaranteed for all interpreters. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkereastmargin",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.14",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkerlifecount": {
    "class": "objecttype",
    "description": "The count of the number of units of measure counted during the life of printer using units of measure as specified by prtMarkerCounterUnit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: In the Laserjet 1200 product the total engine page count is kept in NVRAM however the NVRAM value is only updated every 10 impressions. NOTE: The value returned by this OID will be incremented every page but if power is lost between NVRAM updates, up to 9 impressions of the page count may be lost. The counter will be reset to zero after 999999 pages. The page count is incremented when a sheet of media is pulled from an input tray.",
    "maxaccess": "read-only",
    "name": "prtmarkerlifecount",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkermarktech": {
    "class": "objecttype",
    "description": "The type of marking technology used for this marking sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkermarktech",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePelectrophotographicLaser": 4
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkernorthmargin": {
    "class": "objecttype",
    "description": "The margin, in units identified by prtMarkerAddressabilityUnit, from the leading edge of the medium as the medium flows through the marking engine with the side to be imaged facing the observer. The leading edge is the North edge and the other edges are defined by the normal compass layout of directions with the compass facing the observer. Printing within the area bounded by all four margins is guaranteed for all interpreters. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkernorthmargin",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkerpoweroncount": {
    "class": "objecttype",
    "description": "The count of the number of units of measure counted since the equipment was most recently powered on using units of measure as specified by prtMarkerCounterUnit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkerpoweroncount",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkerprocesscolorants": {
    "class": "objecttype",
    "description": "The number of process colors supported by this marker. A process color of 1 implies monochrome. The value of this object and prtMarkerSpotColorants cannot both be 0. The value of prtMarkerProcessColorants must be 0 or greater. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkerprocesscolorants",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmarkersouthmargin": {
    "class": "objecttype",
    "description": "The margin from the South edge (see prtMarkerNorthMargin) of the medium in units identified by prtMarkerAddressabilityUnit. Printing within the area bounded by all four margins is guaranteed for all interpreters. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersouthmargin",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.12",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkerspotcolorants": {
    "class": "objecttype",
    "description": "The number of spot colors supported by this marker. The value of this object and prtMarkerProcessColorants cannot both be 0. Must be 0 or greater. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkerspotcolorants",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmarkerstatus": {
    "class": "objecttype",
    "description": "The current status of this marker sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The default value assumes the printer is idle and has no malfunctions. Default - 0 (Available and Idle) no toner cartridge - 51 (UnAvailable because Broken (3) + Critical Alert (16) + OffLine (32))",
    "maxaccess": "read-only",
    "name": "prtmarkerstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.15",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliesclass": {
    "class": "objecttype",
    "description": "Indicates whether this supply entity represents a supply that is consumed or a receptacle that is filled. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliesclass",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePother": 1,
          "ePreceptacleThatIsFilled": 4,
          "ePsupplyThatIsConsumed": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliescolorantindex": {
    "class": "objecttype",
    "description": "The value of prtMarkerColorantIndex corresponding to the colorant with which this marker supply sub-unit is associated. This value shall be 0 if there is no colorant table. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliescolorantindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliesdescription": {
    "class": "objecttype",
    "description": "The description of this supply container/receptacle in the localization specified by prtGeneralCurrentLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliesdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtmarkersupplieslevel": {
    "class": "objecttype",
    "description": "The current level if this supply is a container; the remaining space if this supply is a receptacle. If this supply container/receptacle can reliably sense this value, the value is reported by the printer and is read-only; otherwise, the value may be written (by a Remote Control Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. A value of (-3) means that the printer knows that there is some supply/remaining space, respectively. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product cannot sense toner level. The Laserjet 1200 product always return -2 (Unknown).",
    "maxaccess": "read-only",
    "name": "prtmarkersupplieslevel",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliesmarkerindex": {
    "class": "objecttype",
    "description": "The value of prtMarkerIndex corresponding to the marking sub-unit with which this marker supply sub-unit is associated. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has just one marker supply, the toner cartridge, so this value is always 1.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliesmarkerindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 0
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliesmaxcapacity": {
    "class": "objecttype",
    "description": "The maximum capacity of this supply container/receptacle expressed in prtMarkerSuppliesSupplyUnit. If this supply container/receptacle can reliably sense this value, the value is reported by the printer and is read-only; otherwise, the value may be written (by a Remote Control Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product always return -2 (Unknown).",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliesmaxcapacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliessupplyunit": {
    "class": "objecttype",
    "description": "Unit of measure of this marker supply container/receptacle. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliessupplyunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePtenthsOfGrams": 13
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkersuppliestype": {
    "class": "objecttype",
    "description": "The type of this supply. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkersuppliestype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.11.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePtoner": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmarkerwestmargin": {
    "class": "objecttype",
    "description": "The margin from the West edge (see prtMarkerNorthMargin) of the medium in units identified by prtMarkerAddressabilityUnit. Printing within the area bounded by all four margins is guaranteed for all interpreters. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmarkerwestmargin",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.10.2.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathdefaultindex": {
    "class": "objecttype",
    "description": "The value of prtMediaPathIndex corresponding to the default media path; that is, the selection of the default media path. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The only valid value for this object is 1 (simplex).",
    "maxaccess": "read-only",
    "name": "prtmediapathdefaultindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 3,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "prtmediapathdescription": {
    "class": "objecttype",
    "description": "The manufacturer-provided description of this media path in the localization specified by prtGeneralCurrentLocalization. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has one paper path, a simplex path.",
    "maxaccess": "read-only",
    "name": "prtmediapathdescription",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.10",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 255,
            "min": 0
          }
        ]
      },
      "type": "OCTET STRING"
    }
  },
  "prtmediapathmaxmediafeeddir": {
    "class": "objecttype",
    "description": "The maximum physical media size in the feed direction of this media path expressed in units of measure specified by PrtMediaPathMediaSizeUnit. A value of (-1) implies \u0027unlimited\u0027, a value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value returned by this object depends on the value of prtMediaPathMediaSizeUnit. It is 140000 if prtInputDimUnit is ePtenThousandthsOfInches or 355600 if prtInputDimUnit is ePmicrometers. (14000 is the value arrived at because legal paper is the longest allowable on the Laserjet 1200 products.)",
    "maxaccess": "read-only",
    "name": "prtmediapathmaxmediafeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathmaxmediaxfeeddir": {
    "class": "objecttype",
    "description": "The maximum physical media size across the feed direction of this media path expressed in units of measure specified by prtMediaPathMediaSizeUnit. A value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value returned by this object depends on the value of prtMediaPathMediaSizeUnit. It is 85000 if prtInputDimUnit is ePtenThousandthsOfInches or 216000 if prtInputDimUnit is ePmicrometers.",
    "maxaccess": "read-only",
    "name": "prtmediapathmaxmediaxfeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathmaxspeed": {
    "class": "objecttype",
    "description": "The maximum printing speed of this media path expressed in prtMediaPathMaxSpeedUnit\u0027s. A value of (-1) implies \u0027other\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The page size for this performance is 8.5 x 11.",
    "maxaccess": "read-only",
    "name": "prtmediapathmaxspeed",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathmaxspeedprintunit": {
    "class": "objecttype",
    "description": "The unit of measure used in specifying the speed of all media paths in the printer. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: ePimpressionsPerHour is the value that will always be returned for this object. (Print Speed is measured in pages-per-minute (impressions per minute), so ePimpressionsPerHour is a natural extension.)",
    "maxaccess": "read-only",
    "name": "prtmediapathmaxspeedprintunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePimpressionsPerHour": 7
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmediapathmediasizeunit": {
    "class": "objecttype",
    "description": "The units of measure of media size for use in calculating and relaying dimensional values for all media paths in the printer. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtmediapathmediasizeunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePmicrometers": 4,
          "ePtenThousandthsOfInches": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtmediapathminmediafeeddir": {
    "class": "objecttype",
    "description": "The minimum physical media size in the feed direction of this media path expressed in units of measure specified by prtMediaPathMediaSizeUnit. A value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value returned by this object depends on the value of prtMediaPathMediaSizeUnit. It is 50000 if prtInputDimUnit is ePtenThousandthsOfInches or 127000 if prtInputDimUnit is ePmicrometers.",
    "maxaccess": "read-only",
    "name": "prtmediapathminmediafeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathminmediaxfeeddir": {
    "class": "objecttype",
    "description": "The minimum physical media size across the feed direction of this media path expressed in units of measure specified by prtMediaPathMediaSizeUnit. A value of (-2) implies \u0027unknown\u0027. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The value returned by this object depends on the value of prtMediaPathMediaSizeUnit. It is 30000 if prtInputDimUnit is ePtenThousandthsOfInches or 76200 if prtInputDimUnit is ePmicrometers. This size corresponds to a Monarch envelope. ",
    "maxaccess": "read-only",
    "name": "prtmediapathminmediaxfeeddir",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathstatus": {
    "class": "objecttype",
    "description": "The current status of this media path. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product have one paper path, a simplex path. The default values assume the printer is idle. Default - 0 (Available and Idle) paper motion - 6 (Available and Busy) paper out in all trays - 9 (Non-Critical Alert(8) + Unavailable and OnRequest(1)) paper mount (any tray) - 0 (Available and Idle) manual feed prompt (PaperMount) - 48 (Critical Alert (16) + OffLine (32))",
    "maxaccess": "read-only",
    "name": "prtmediapathstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.11",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtmediapathtype": {
    "class": "objecttype",
    "description": "The type of the media path for this media path. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: This object describes how many paths there are through the engine disregarding the paper source (tray 1, 2, or 3). For the Laserjet 1200 product there is exactly one such path, a simplex path.",
    "maxaccess": "read-only",
    "name": "prtmediapathtype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.13.4.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePsimplex": 5
        }
      },
      "type": "INTEGER"
    }
  },
  "prtoutputcapacityunit": {
    "class": "objecttype",
    "description": "The unit of measurement for use in calculating and relaying capacity values for this output sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: A sheet is a single piece of 20 pound paper.",
    "maxaccess": "read-only",
    "name": "prtoutputcapacityunit",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePfeet": 16,
          "ePmeters": 17,
          "ePmicrometers": 4,
          "ePsheets": 8,
          "ePtenThousandthsOfInches": 3
        }
      },
      "type": "INTEGER"
    }
  },
  "prtoutputdefaultindex": {
    "class": "objecttype",
    "description": "The value of prtOutputIndex corresponding to the default output sub-unit; that is, this object selects the default output destination. This value shall be -1 if there is no default output subunit specified for the printer as a whole. In this case, the actual default output subunit may be specified by means outside the scope of this MIB, such as by each interpreter in a printer with multiple interpreters. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has only one output bin, a face-down bin located at the top of the printer.",
    "maxaccess": "read-only",
    "name": "prtoutputdefaultindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.1.1.7",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtoutputmaxcapacity": {
    "class": "objecttype",
    "description": "The maximum capacity of this output sub-unit in output sub-unit capacity units (PrtCapacityUnitTC). There is no convention associated with the media itself so this value essentially reflects claimed capacity. If this output sub-unit can reliably sense this value, the value is sensed by the printer and may not be changed by management requests; otherwise, the value may be written (by a Remote Control Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: Note: The Laserjet 1200 product cannot sense how much is in the output bin. The output bin can hold 150 sheets. This object refers only to the face-down output bin, not the face-up output tray.",
    "maxaccess": "read-only",
    "name": "prtoutputmaxcapacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtoutputremainingcapacity": {
    "class": "objecttype",
    "description": "The remaining capacity of the possible output sub-unit capacity in output sub-unit capacity units (PrtCapacityUnitTC) of this output sub-unit. If this output sub-unit can reliably sense this value, the value is sensed by the printer and may not be modified by management requests; otherwise, the value may be written (by a Remote Control Panel or a Management Application). The value (-1) means other and specifically indicates that the sub-unit places no restrictions on this parameter. The value (-2) means unknown. The value (-3) means that the printer knows that there remains capacity for at least one unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product does not have any sensing on the output bin, so it will always report unknown (-2). Note that for the Laserjet 1200 product this object is read-only (because any values written by a Remote Control Panel or a Management Application would be unreliable).",
    "maxaccess": "read-only",
    "name": "prtoutputremainingcapacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtoutputstatus": {
    "class": "objecttype",
    "description": "The current status of this output sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product cannot sense the output tray so this object will always return 5 (Unknown Status).",
    "maxaccess": "read-only",
    "name": "prtoutputstatus",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "prtoutputtype": {
    "class": "objecttype",
    "description": "The type of technology supported by this output sub-unit. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details. Additional information: The Laserjet 1200 product has only one output bin, a face-down bin located at the top of the printer.",
    "maxaccess": "read-only",
    "name": "prtoutputtype",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.9.2.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "ePcontinousFanFold": 7,
          "ePcontinuousRollDevice": 5,
          "ePmailBox": 6,
          "ePother": 1,
          "ePremovableBin": 3,
          "ePunRemovableBin": 4,
          "ePunknown": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "prtstoragerefindex": {
    "class": "objecttype",
    "description": "The value of the hrDeviceIndex of the printer device that this storageEntry is associated with. Refer to Internet Draft Printer MIB, expiring Sept. 1997 for more details.",
    "maxaccess": "read-only",
    "name": "prtstoragerefindex",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.2.5.2.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 65535,
            "min": 1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "pysmi_continue": {
    "class": "objecttype",
    "description": "A device can support a class of errors called continuable errors. When a continuable error is encountered, the device requires a continue event to occur before the device will continue operation. One continue event is setting the CONTINUE object to eInitiateAction. Devices can support other continue events, like auto-continue. A continue event causes the continuable error to be acknowledged, thus allowing the device to continue. Each device needs to list the continuable errors. If the device doesn\u0027t currently have an unacknowledged continuable error, the response will contain \u003cgenErr\u003e. Additional information: Consult Laserjet 1200 ERS for a list of continuable errors.",
    "maxaccess": "write-only",
    "name": "continue",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eInitiateAction": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "reprint": {
    "class": "objecttype",
    "description": "Returns or changes the reprint (jam recovery) setting. If eOn, then the device will reprint pages jammed pages. If eOff, the device will not attempt to reprint jammed pages. If eAuto, a device dependent algorithm (which should be documented in the POS) will be used to determine if the page gets reprinted. This object controls all PDLs, unless a specific PDL supports its own reprint control mechanism. To date, only PostScript has a PDL reprint control mechanism. Additional information: Setting this object when the printer is not idle, may cause a status of \u003cnoError\u003e to be returned, but the new value will not take effect until a job boundary is reached. If a get is done on object before the job boundary is reached, the value last set will be returned. When the value is set to eOff, pages will not be stored in the printer, and in the event of a paper jam, will have to be reprinted. When the value is set to eOn, pages will be stored until delivery, therefore, in the event of a paper jam, the page will be reprinted. When the value is set to eAuto, the printer will behave as though it is eOff when there is less than seven megabytes of memory installed in the printer. When additional memory is installed, to total at least seven megabytes of RAM, the setting of eAuto will behave as though it was set to eOn.",
    "maxaccess": "read-write",
    "name": "reprint",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.36",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eAuto": 3,
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "resource_saving": {
    "class": "objecttype",
    "description": "Returns or changes PDL resource saving. Resource saving stores a PDL\u0027s permanent soft resources, like fonts, even when another PDL is active. Resource saving is also called environment saving. When eOff, resource saving is disabled. When ON, resource saving is enabled and memory is set aside for each PDL based on that PDL\u0027s resource saving memory size object, to store that PDL\u0027s permanent soft resources. When eAuto, resource saving is enabled and memory space for each installed PDL is determined automatically. The device POS should document what values are legal when only one PDL is installed. Additional information: This object is supported only if PostScript is installed. When PCL (including PCL/XL) is the only PDL installed in Laserjet 1200, eOn is not a legal value. Attempting to set this object to eOn with a PCL-only printer will result in a status of \u003cbadValue\u003e being returned. When PostScript is installed and less than 12M RAM is present, resource saving is not available. The only valid value for this object is eOff. Attempting to set this object to eOn or eAuto will cause a status of \u003cbadValue\u003e being returned. When PostScript is installed and 12M RAM or more are present, all values are valid",
    "maxaccess": "read-write",
    "name": "resource_saving",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.6",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eAuto": 3,
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "self_test": {
    "class": "objecttype",
    "description": "Writing this object allows a device self test to be started. Reading this object provides an indication what self-test is currently executing, if any. Actual self-test operation is device specific. A self test may not be allowed at any arbitrary time. If the device supports the requested self test, but can not start the execution of the self test when requested, the device will respond with \u003cgenErr\u003e. If a non-destructive self test is being started, the device will generate a response before the self test is completed. RECOMMENDATION: If the device is ready (i.e. the NOT- READY-PRINTER object does not contain any items, except maybe being off-line) and is idle (i.e. the NOT-IDLE object does not contain any items), this request should always succeed. This provides a mechanism for driver writers to always determine if the action will succeed or not. Additional information: The eNonDestructiveSelfTest performs limited testing on the printer and its attached paper handling devices. After the self-test is complete a configuration page is printed. The recommended way to cause a configuration page to be printed is to use the PRINT-INTERNAL-PAGE object. A continuous self test cannot be started or terminated using this OID. When the printer is idle, setting this object to eNonDestructiveSelfTest results in a status of \u003cnoError\u003e and a value of eNonDestructiveSelfTest being returned. If the printer is not idle (whether printing an external job, printing an internal page or running self test), a status of \u003cgenErr\u003e status will be returned with a value of eNotInASelfTest. When the printer is idle, setting this object to eNonDestructiveSelfTest causes the configuration page to be formatted and put in the printer\u0027s print queue. Attempting to set this object before the configuration page has completed being formatted and printed will cause \u003cgenErr\u003e status to be returned with a value of eNotInASelfTest. After the configuration page is in the queue, a get on this object will return a value of eNotInASelfTest. Setting the value to eNotInASelfTest is not supported on Laserjet 1200. Once the test has started, it will finish printing. Likewise, if the PRINT-INTERNAL-PAGE object is set to a valid value and that page has not printed when this object is set to eNonDestructiveSelfTest, a status of \u003cgenErr\u003e status with a value of eNotInASelfTest will be returned until the internal page has printed.",
    "maxaccess": "read-write",
    "name": "self_test",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.5.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eNonDestructiveSelfTest": 4,
          "eNotInASelfTest": 1
        }
      },
      "type": "INTEGER"
    }
  },
  "separation_setting": {
    "class": "objecttype",
    "description": "When set this object will cause the separation setting of the device to be changed to the nearest appropriate value. When the object is read it will return the current separation setting. Each engine will have different supported values. The object should snap to the nearest supported value. Different products could use this value in different ways. Typically, this value would be a voltage in an EP system, but could be some other parameter on an inkjet. The device POS will specify supported values, any snap behavior and will detail the product specific meaning of \u0027device separation\u0027. Additional information: This object changes the charge so the media does not curl too much causing the media to jam under the cartridge. Any value \u003e= 150 snaps to 200.",
    "maxaccess": "read-write",
    "name": "separation_setting",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 200,
            "min": 100
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "serial_number": {
    "class": "objecttype",
    "description": "Identifies the serial number for the device. If the SERIAL-NUMBER object is set by the user, then setting the object does not need to be protected. If the SERIAL-NUMBER object is set at the factory, then the SERVICE-PASSWORD object must be set correctly before the SERIAL-NUMBER object is writable. If this is a writable object, the POS should indicate the maximum supported string length. If possible, encode the serial number in a symbol set (like Roman-8) that matches the ASCII character set and limit the characters used to ASCII characters. Additional information: This value IS AFFECTED BY NVRAM RESETS, it is set to the default value of XXXXXXXXXX when an NVRAM init is done.",
    "maxaccess": "read-only",
    "name": "serial_number",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.3.3",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "size": [
          {
            "max": 10,
            "min": 0
          }
        ]
      },
      "type": "DisplayString"
    }
  },
  "service_password": {
    "class": "objecttype",
    "description": "When set to the password value, other service related objects become \u0027visible\u0027 (i.e readable) and/or become writable. When written with any other value, the service related objects become \u0027hidden\u0027 (i.e. are no longer readable) and/or are not longer writable. The objects that can be effected by the SERVICE-PASSWORD object include: SERIAL-NUMBER and TOTAL-ENGINE-PAGE- COUNT. The password value, and the list of objects effected by the SERVICE-PASSWORD being set to the correct value, should be documented in the device POS. Additional information: The objects that can be effected by the SERVICE- PASSWORD are: TOTAL-ENGINE-PAGE-COUNT, PRINT-ENGINE- JAM-COUNT, PRINT-ENGINE-MISPICK-COUNT",
    "maxaccess": "write-only",
    "name": "service_password",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.1.9",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "settings_intray": {
    "class": "objectidentity",
    "name": "settings_intray",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.1"
  },
  "settings_io": {
    "class": "objectidentity",
    "name": "settings_io",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.2.1.1"
  },
  "settings_job": {
    "class": "objectidentity",
    "name": "settings_job",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.6.1"
  },
  "settings_pdl": {
    "class": "objectidentity",
    "name": "settings_pdl",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1"
  },
  "settings_prt_eng": {
    "class": "objectidentity",
    "name": "settings_prt_eng",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.1"
  },
  "settings_system": {
    "class": "objectidentity",
    "name": "settings_system",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.1"
  },
  "simm": {
    "class": "objectidentity",
    "name": "simm",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1"
  },
  "simm1": {
    "class": "objectidentity",
    "name": "simm1",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.1"
  },
  "simm1_capacity": {
    "class": "objecttype",
    "description": "Returns an indication of the capacity of the SIMM installed in SIMM slot 1. The capacity is dependent on the type of option, as indicated by the SIMM1-TYPE object. This object has no meaning if the installed option type is eUnknown or eReadOnlyMemory. This object contains the size, in bytes, if the installed option type is eVolatileRandomAccessMemory, eNonVolatileRandomAccessMemory, eFlashMemory, or eDiskDrive. If the type of the installed option is eRamRom, this object contains the size, in bytes, of the random access memory. If the type of the installed option is eInputPHD, the capacity indicates the number of input trays supported by the installed option. If the type of the installed option is eOutputPHD, the capacity indicates the number of output bins supported by the installed option. If the type of the installed option is eIOCard, the capacity indicates the number of logical I/O ports supported by the I/O card. Additional information: Returns an indication of the capacity of the installed option in bytes. This object is not supported unless the SIMM1-TYPE type is eVolatileRandomAccessMemory or eRamRom. For eRamRom only the size of the Ram portion of the simm (dimm) is returned.",
    "maxaccess": "read-only",
    "name": "simm1_capacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.1.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "simm1_type": {
    "class": "objecttype",
    "description": "Returns an indication of the type of option installed in SIMM slot 1. eEmpty means the device did not detect any option installed in the interface slot. eUnknown means the device doesn\u0027t recognize the installed option. eUnSupported means the device recognizes the installed option, but does not support the option. eReadOnlyMemory means the installed option contains ROM Ics. eVolatileRandomAccessMemory means the installed option contains RAM ICs that loose data when the power is turned off. eNonVolatileRandomAccessMemory means that the installed option contains RAM ICs that do not loose data when the power is turned off. eFlashMemory means that the installed option contains a type of non-volatile RAM that needs to be erased before it can be written. eDiskDrive means the installed option contains a disk drive. eRamRom means the installed option contains both volatile random access memory and read only memory. eInputPHD means the installed option is an input paper handling device. eOutputPHD means the installed option is an output paper handling device. eIOCard means the installed option is an I/O card. Additional information: This object is used to describe DIMMs instead of SIMMs on the Laserjet 1200. eRamRom is used to denote the Laserjet 1200 combo dimm.",
    "maxaccess": "read-only",
    "name": "simm1_type",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.1.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eEmpty": 1,
          "eRamRom": 9,
          "eReadOnlyMemory": 4,
          "eUnSupported": 3,
          "eUnknown": 2,
          "eVolatileRandomAccessMemory": 5
        }
      },
      "type": "INTEGER"
    }
  },
  "simm2": {
    "class": "objectidentity",
    "name": "simm2",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.2"
  },
  "simm2_capacity": {
    "class": "objecttype",
    "description": "Returns an indication of the capacity of the SIMM installed in SIMM slot 2. See SIMM1-CAPACITY for a description. Additional information: Returns an indication of the capacity of the installed option in bytes. This object is not supported unless the SIMM2-TYPE type is eVolatileRandomAccessMemory or eRamRom. For eRamRom only the size of the Ram portion of the simm (dimm) is returned.",
    "maxaccess": "read-only",
    "name": "simm2_capacity",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.2.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "simm2_type": {
    "class": "objecttype",
    "description": "Returns an indication of the type of option installed in SIMM slot 2. See SIMM1-TYPE for a description. Additional information: This object is used to describe DIMMs instead of SIMMs on the Laserjet 1200. eRamRom is used to denote the Laserjet 1200 combo dimm.",
    "maxaccess": "read-only",
    "name": "simm2_type",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.4.1.2.4",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eEmpty": 1,
          "eRamRom": 9,
          "eReadOnlyMemory": 4,
          "eUnSupported": 3,
          "eUnknown": 2,
          "eVolatileRandomAccessMemory": 5
        }
      },
      "type": "INTEGER"
    }
  },
  "sleep_mode": {
    "class": "objecttype",
    "description": "Returns eTrue if the device is in energy saving sleep mode, otherwise returns eFalse. Setting SLEEP-MODE to eFalse causes the device to wake up, if it is in sleep mode. Setting SLEEP-MODE to eTrue causes the device to go into sleep mode. Additional information: Laserjet 1200 will always be in sleep mode except when either processing a print job or in an error state.",
    "maxaccess": "read-only",
    "name": "sleep_mode",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.1.2",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eFalse": 1,
          "eTrue": 2
        }
      },
      "type": "INTEGER"
    }
  },
  "source_subsystem": {
    "class": "objectidentity",
    "name": "source_subsystem",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.2"
  },
  "status_pdl": {
    "class": "objectidentity",
    "name": "status_pdl",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.2"
  },
  "status_prt_eng": {
    "class": "objectidentity",
    "name": "status_prt_eng",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.2"
  },
  "status_system": {
    "class": "objectidentity",
    "name": "status_system",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.2"
  },
  "system": {
    "class": "objectidentity",
    "name": "system",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1"
  },
  "tables": {
    "class": "objectidentity",
    "name": "tables",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.7"
  },
  "test": {
    "class": "objectidentity",
    "name": "test",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.1.5"
  },
  "total_engine_page_count": {
    "class": "objecttype",
    "description": "Total number of pages printed by the device. POS indicates if the total engine page count is kept in NVRAM, and the maximum supported value before the page count rolls over to zero. Additional information: This object is stored in NVRAM. The maximum value of this count is 1000000 before it rolls over to zero.",
    "maxaccess": "read-write",
    "name": "total_engine_page_count",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.2.5",
    "status": "optional",
    "syntax": {
      "class": "type",
      "type": "INTEGER"
    }
  },
  "transfer_setting": {
    "class": "objecttype",
    "description": "When set the object will cause the transfer setting of the device to be changed to the nearest appropriate value. When the object is read it will return the current transfer setting. Each engine will have different supported values. The object should snap to the nearest supported value. Different products could use this value in different ways. Typically, this value would be a voltage on an EP system, but could be a pressure level on an inkjet. Additional information: This setting is a voltage adjustment in the LaserJet 1200. Any value \u003e= 150 snaps to 200.",
    "maxaccess": "read-write",
    "name": "transfer_setting",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.1.8",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 200,
            "min": 100
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "tray1_fuser_temperature": {
    "class": "objecttype",
    "description": "The fuser temperature to be used when printing media from Tray 1. The value zero is the default temperature. Values less than zero are progressively lower and values greater than zero are progressively higher. The range of values supported is device specific. Additional information: Laserjet 1200 supports 4 fuser temperatures. Zero (0) is the default temperature, one (1) is a higher temperature (for use on media like cardstock), two (2) is an even higher temperature (for use on rough media), negative one (-1) is a lower temperature (for use on media like transparencies). Setting to an unsupported value causes the printer to snap to the nearest supported value and to return \u003cnoError\u003e status along with the actual value that was written. The snap values are as follows: \u003c=-1 snaps to -1 \u003e=2 snaps to 2",
    "maxaccess": "read-write",
    "name": "tray1_fuser_temperature",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.3.1.13",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "range": [
          {
            "max": 2,
            "min": -1
          }
        ]
      },
      "type": "INTEGER"
    }
  },
  "tray1_media_size_loaded": {
    "class": "objecttype",
    "description": "Returns the media size that is currently configuredconfigured in tray #1. This object can be set to indicate the media size currently loaded, if the printer supports input trays that can not sense the media size. Complete list of supported media sizes along with their dimensions are listed in the \u0027\u0027Media Size Table\u0027\u0027 near the end of this document.",
    "maxaccess": "read-write",
    "name": "tray1_media_size_loaded",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.4.1.3.3.1.1",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eCommercial10": 81,
          "eCustom": 101,
          "eFoolscap": 10,
          "eISOandJISA4": 26,
          "eISOandJISA5": 25,
          "eInternationalB5": 100,
          "eInternationalC5": 91,
          "eInternationalDL": 90,
          "eJISB5": 45,
          "eJapanesePostcardDouble": 72,
          "eJapanesePostcardSingle": 71,
          "eMonarch": 80,
          "eROC16K": 17,
          "eUSExecutive": 1,
          "eUSLegal": 3,
          "eUSLetter": 2,
          "eUnknownMediaSize": 32767
        }
      },
      "type": "INTEGER"
    }
  },
  "wide_a4": {
    "class": "objecttype",
    "description": "Returns or changes the wide A4 logical page size setting. If eOn, then the margins/printable area of A4 paper will be changed to allow 80 10-pitch characters to be printed on a single line. If eOff then the industry standard A4 logical page size is used.",
    "maxaccess": "read-write",
    "name": "wide_a4",
    "nodetype": "scalar",
    "oid": "1.3.6.1.4.1.11.2.3.9.4.2.1.3.3.1.37",
    "status": "optional",
    "syntax": {
      "class": "type",
      "constraints": {
        "enumeration": {
          "eOff": 1,
          "eOn": 2
        }
      },
      "type": "INTEGER"
    }
  }
}
